{
  "meta": {
    "scrapedAt": "2025-12-21T01:09:39.415Z",
    "total": 100,
    "withRatings": 90
  },
  "mostControversial": [
    {
      "letterboxdRating": 4.08,
      "letterboxdSlug": "the-thin-red-line",
      "topReviews": [
        {
          "text": "I heard people talk about immortality, but I ain't seen it. l wondered how it'd be when l died. What it'd be like to know that this breath now was the last one you was ever gonna draw. l just hope l c..."
        },
        {
          "text": "Nature as witness to men's destruction. Trees as tombstones circling us, venomous snakes interrupting gun battles, shy plants withdrawing from a soldier's touch. Sunlight piercing through layers of gr..."
        },
        {
          "text": "The moment Terrence Malick realized voiceover narration could be whispered"
        },
        {
          "text": "Terrence Malick was definitely the type of kid that would’ve gotten distracted by a butterfly in the middle of a soccer game. My thoughts while watching the movie: “Wait is that John Travolta?” “Wait ..."
        },
        {
          "text": "As the next installment in our unofficial Malick festival, we revisited THE THIN RED LINE last night. This was the first Malick film I ever saw, and I'd never seen anything like it. This is a movie in..."
        }
      ],
      "userRating": 1,
      "ratingDiff": -3.08,
      "title": "The Thin Red Line",
      "year": 1998
    },
    {
      "letterboxdRating": 3.53,
      "letterboxdSlug": "death-of-a-salesman",
      "topReviews": [
        {
          "text": "I think this would’ve been a lot more enjoyable to watch if I didn’t have to do like 12 essays on it"
        },
        {
          "text": "The most interesting thing about this half baked adaptation is seeing John Malkovich when he had hair."
        },
        {
          "text": "\"Will you take that phony dream and burn it before something happens?\" The initial entry in Volker Schlöndorff's vicissitudinous stateside output is a foursquare television adaptation of Arthur Miller..."
        },
        {
          "text": "young john malkovich hot? feeling confused"
        },
        {
          "text": "I've never seen a film better capture the intimacy and immediacy of a stage performance."
        }
      ],
      "userRating": 1,
      "ratingDiff": -2.53,
      "title": "Death of a Salesman",
      "year": 1985
    },
    {
      "letterboxdRating": 4.4,
      "letterboxdSlug": "barry-lyndon",
      "topReviews": [
        {
          "text": "Showed this to my mom today. She thinks 2001: A Space Odyssey is the most boring film of all time, she walked out of A Clockwork Orange and she never ceases to complain about every aspect in Dr. Stran..."
        },
        {
          "text": "marie antoinette for fellas"
        },
        {
          "text": "One of the most interesting things about Barry Lyndon is that he's boring. He's a bit stupid - but not enough for me to feel sorry for him; he's a bit pompous - but not enough for me to hate him; he's..."
        },
        {
          "text": "if i lived in the 1700s i too would just go on absolutely every side mission imaginable"
        },
        {
          "text": "I maintain now and always that this is one of the great comedies, a slow burn of greed, cowardice and arrogance that depicts an aristocratic structure that creates arbitrary divisions among European n..."
        }
      ],
      "userRating": 2,
      "ratingDiff": -2.4000000000000004,
      "title": "Barry Lyndon",
      "year": 1975
    },
    {
      "letterboxdRating": 4.36,
      "letterboxdSlug": "se7en",
      "topReviews": [
        {
          "text": "KEVIN SPACEY GIVES BRAD PITT HEAD !!! *NO CLICKBAIT*"
        },
        {
          "text": "se7en's ending scene is by far my favorite unboxing video on youtube"
        },
        {
          "text": "I recently watched a mini-doc on David Fincher's film techniques. One of the scenes that's mentioned is the famous \"box\" scene. When he filmed Brad Pitt and Morgan Freeman, he used a handheld camera a..."
        },
        {
          "text": "my mom said that this is the scariest film shes ever seen and she saw it while she was pregnant with me, and im 100% convinced she could have gone into stress-induced labor during the opening credits ..."
        },
        {
          "text": "someone: *makes a good witty comeback* bread poot: sit back you fucking freak shut your fucking mouth you're a movie of the week you're a fucking t-shirt at best"
        }
      ],
      "userRating": 2,
      "ratingDiff": -2.3600000000000003,
      "title": "Se7en",
      "year": 1995
    },
    {
      "letterboxdRating": 3.32,
      "letterboxdSlug": "pretty-in-pink",
      "topReviews": [
        {
          "text": "some of y’all actually believe that duckie was straight ?? i have to laugh"
        },
        {
          "text": "what a fucking awful dress"
        },
        {
          "text": "that scene where the lovable duckie dale slides into the record store and dances/lip syncs to try a little tenderness by otis redding will forever be one of the most iconic moments in cinematic histor..."
        },
        {
          "text": "Young, stupid brain: Andie should end up with Duckie because he's the only halfway decent guy in the whole movie. And he does the Kenny Ortega lip-sync dance really well. Grown-up, normal brain : Andi..."
        },
        {
          "text": "I still don't get how we're supposed to feel bad for Duckie when he's really intolerable???"
        }
      ],
      "userRating": 1,
      "ratingDiff": -2.32,
      "title": "Pretty in Pink",
      "year": 1986
    },
    {
      "letterboxdRating": 3.25,
      "letterboxdSlug": "redacted",
      "topReviews": [
        {
          "text": "\"What do ya'll think is gonna be the first casualty of this entire conflict....it's gonna be the truth.\" Just notes: Not an addiction to images, but an addiction to image making. The perfect example o..."
        },
        {
          "text": "“It’s impolite to stare.” When we’re talking about filmmakers who have bailed on the present versus those who meet it head on, spill one out for BDP, the only surviving New Hollywooder who would, coul..."
        },
        {
          "text": "are you not supporting the troops? although the plot points come directly from another one of his films, this has much of the same effect as Hi Mom! - Brian De Palma the political ironist at his best...."
        },
        {
          "text": "Basically a Casualties of War remake but this time it’s found footage and also very bad"
        },
        {
          "text": "fascinating/horrifying use of the mockumentary format (blogs, amateur camcorders, night vision, security cams, simultaneously creating digital distance and formal intimacy) and as far as american depi..."
        }
      ],
      "userRating": 1,
      "ratingDiff": -2.25,
      "title": "Redacted",
      "year": 2007
    },
    {
      "letterboxdRating": 4.22,
      "letterboxdSlug": "the-truman-show",
      "topReviews": [
        {
          "text": "if i lived in a town where everyone looked like a republican i'd wanna leave too"
        },
        {
          "text": "The most fun and lighthearted horror movie ever made"
        },
        {
          "text": "worried for the guy taking the longest bath of all time"
        },
        {
          "text": "the more i think about the ending, the more i feel bad for truman. the way he’s entering a world where he expects to finally be free and in charge of his own destiny, but is actually entering an envir..."
        },
        {
          "text": "the truman show was black mirror before black mirror was black mirror"
        }
      ],
      "userRating": 2,
      "ratingDiff": -2.2199999999999998,
      "title": "The Truman Show",
      "year": 1998
    },
    {
      "letterboxdRating": 4.11,
      "letterboxdSlug": "the-royal-tenenbaums",
      "topReviews": [
        {
          "text": "“I’m sorry for your loss. Your mother was a terribly attractive woman.”"
        },
        {
          "text": "\"I've had a rough year, dad.\" WES ANDERSON WANTS ME DEAD"
        },
        {
          "text": "The scene with Richie Tenenbaum in the bathroom while Needle in the Hay plays....powerful stuff. It gives me chills every time"
        },
        {
          "text": "ok so i read an article about the tenenbaum children and it theorized that when they become adults and grow apart they start to realize that they're actually not as special as they thought they were w..."
        },
        {
          "text": "put them and the roy siblings in a room together let’s see what happens"
        }
      ],
      "userRating": 2,
      "ratingDiff": -2.1100000000000003,
      "title": "The Royal Tenenbaums",
      "year": 2001
    },
    {
      "letterboxdRating": 3.01,
      "letterboxdSlug": "here-2024",
      "topReviews": [
        {
          "text": "My favorite parts of Robert Zemeckis’ Here 3. Benjamin Franklin 2. Dinosaurs 1. The inventor of the La-Z Boy and his sexy wife, the true stars of the film, the entire thing should’ve just been about t..."
        },
        {
          "text": "93 I usually try not to bother with the reception of a new release, but it's a bit disconcerting to see such a furious and mean-spirited response towards an ambitious film from one of cinema's greates..."
        },
        {
          "text": "The way I didn’t care about anything"
        },
        {
          "text": "would maybe be insanely good if it wasn't just Boomer Diorama"
        },
        {
          "text": "ingenious concept, mediocre execution, worst screenplay of the last several years. what else do you give that but a perfectly balanced 2.5 stars."
        }
      ],
      "userRating": 1,
      "ratingDiff": -2.01,
      "title": "Here",
      "year": 2024
    },
    {
      "letterboxdRating": 4.01,
      "letterboxdSlug": "the-lighthouse-2019",
      "topReviews": [
        {
          "text": "idiots will call this a staggering retelling of the myth of prometheus through the eyes of the american laborer, the fire of the gods becoming success under capitalism, an unattainable fiction that dr..."
        },
        {
          "text": "not a cell phone in sight. just guys being dudes"
        },
        {
          "text": "dinner with papaw tonight...❤️ he made 12 lobsters for all 6 wickies and only one showed. 😢 love him"
        },
        {
          "text": "Robert Eggers drenched in sweat running to his desk, scratching down quickly in his notebook only this: mussy (mermaid pussy)"
        },
        {
          "text": "thomas : yer fond of me lobster ain’t ye??? 😢 winslow : are ye in the right headspace to receive information that could possibly hurt ye"
        }
      ],
      "userRating": 2,
      "ratingDiff": -2.01,
      "title": "The Lighthouse",
      "year": 2019
    }
  ],
  "underrated": [
    {
      "letterboxdRating": 3.1,
      "letterboxdSlug": "youth-in-revolt",
      "topReviews": [
        {
          "text": "Michael Cera is Michael Cera in a Michael Cera film where Michael Cera plays Michael Cera in a Michael Cera film. Micheal Cera has his Michael Cera moments though. 3 Michael Ceras out of 5 Michael Cer..."
        },
        {
          "text": "this is what zero pussy does to a mf"
        },
        {
          "text": "i have two personalities nicest guy you'll ever meet and twisted fucking psychopath"
        },
        {
          "text": "if fight club was good"
        },
        {
          "text": "Me: what a shit film Also Me: 4 stars, add to faves list"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.9,
      "title": "Youth in Revolt",
      "year": 2009
    },
    {
      "letterboxdRating": 3.15,
      "letterboxdSlug": "cheaper-by-the-dozen-2003",
      "topReviews": [
        {
          "text": "\" i heard you were dissing my family \" \"i don't even know your family LOSER \" \"you do now 👊\" \"my latte! \""
        },
        {
          "text": "it's pretty amazing how this film can make me want no kids and 12 kids all at the same time"
        },
        {
          "text": "this is so good but also i can't believe they tried to convince us even for a moment that tom welling would have been bullied by jared padalecki"
        },
        {
          "text": "ʏᴏᴜ SOAKED ʜɪs UNDERWEAR ɪɴ MEAT... THAT ɪs sᴏ WRONG ... FUNNY ! BUT ᴡʀᴏɴɢ ..."
        },
        {
          "text": "tom welling im free on thursdays if you want to hang out"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.85,
      "title": "Cheaper by the Dozen",
      "year": 2003
    },
    {
      "letterboxdRating": 3.16,
      "letterboxdSlug": "kindergarten-cop",
      "topReviews": [
        {
          "text": "70 A rare action-comedy that is more comedy than action. Most of this is just Arnold Schwarzenegger hanging out with small children and it's adorable. What a concept."
        },
        {
          "text": "\"Are these all your lunches? You mean you eat other people's lunches? STOP IT!\" I just love Arny. No matter what he does, you just gotta love the guy. He always puts a smile on my face."
        },
        {
          "text": "Probably no one on Earth needs more writing from me about Schwarzenegger, so instead a word of praise for the key supporting player in the movie: Pamela Reed as Schwarzenegger’s partner, Phoebe O’Hara..."
        },
        {
          "text": "an Arnold quote generator on par with BATMAN & ROBIN and a surprisingly violent and unpleasant family comedy. the end of this movie will fuck up that poor little boy for the rest of his life, it's pre..."
        },
        {
          "text": "Here’s how Arnold ushered in the 90s: Total Recall Kindergarten Cop T2: Judgement Day A fascinating run for a man who was pinned as the meathead of the 80s. Not a slight on his 80s filmography, which ..."
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.8399999999999999,
      "title": "Kindergarten Cop",
      "year": 1990
    },
    {
      "letterboxdRating": 3.2,
      "letterboxdSlug": "jack-reacher",
      "topReviews": [
        {
          "text": "i liked this movie because it was 2 hours of tom cruise mind-fucking people. a typical scene: Jack Reacher: \"does shelly work here?\" Random Vaguely Evil N00B: \"she's not in today.\" Jack Reacher: \"than..."
        },
        {
          "text": "Tom Cruise nearly beats a man to death with another man's head."
        },
        {
          "text": "Remembered this being just “pretty good” but clearly I was an idiot ten years ago. This is so fucking great. If it came out now I would be throwing a parade in its honor. Maybe I should give it an ext..."
        },
        {
          "text": "pretty sure i rented this in 1996."
        },
        {
          "text": "In order to buy a construction company in Pittsburgh, you gotta dome a bunch of people with a sniper rifle to cover up overcharging the city a few thousand dollars for another bridge. Pittsburgh just ..."
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.7999999999999998,
      "title": "Jack Reacher",
      "year": 2012
    },
    {
      "letterboxdRating": 3.31,
      "letterboxdSlug": "dan-in-real-life",
      "topReviews": [
        {
          "text": "sad steve carell characters are very personal to me"
        },
        {
          "text": "Big family sharing a cozy vacation house in Rhode Island, wearing sweaters? Perfect movie"
        },
        {
          "text": "matthew morrison jumpscare"
        },
        {
          "text": "In what world would a woman like Juliette Binoche date a man like Dane Cook"
        },
        {
          "text": "why is steve carell so sad all the time someone please give him a hug"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.69,
      "title": "Dan in Real Life",
      "year": 2007
    },
    {
      "letterboxdRating": 3.51,
      "letterboxdSlug": "game-night",
      "topReviews": [
        {
          "text": "the delivery of “OH NO HE DIED”... maybe rachel’s oscar nomination got lost in the mail"
        },
        {
          "text": "Holy shit. This is... maybe the best mainstream comedy movie I have seen in a very long time. Every single aspect of it was done well! Direction, script, even the way it’s shot. Every actor is hilario..."
        },
        {
          "text": "well, when life gives you plemons"
        },
        {
          "text": "my girlfriend asked which one of southwest’s in-flight film selections would best distract her from her fear of flying and i evangelized about how good Game Night was. then i watched it over her shoul..."
        },
        {
          "text": "Things missing from Game Night : Tired, overdone high-on-drugs sequence; someone’s bare ass we didn’t ask to see; James Franco; a barrage of penis, boobs and vagina jokes; a diarrhea scene ( classic c..."
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.4900000000000002,
      "title": "Game Night",
      "year": 2018
    },
    {
      "letterboxdRating": 3.54,
      "letterboxdSlug": "grease",
      "topReviews": [
        {
          "text": "danny lowkey gay asf"
        },
        {
          "text": "the feminism leaving my body as Sandy changes everything about herself to be with a dude but looks really hot in a leather catsuit so it’s fine"
        },
        {
          "text": "i can buy the car flying away but sandy becoming a pick-me girl i will never understand"
        },
        {
          "text": "actively ignoring that half the cast looks 40 years old"
        },
        {
          "text": "tell me about it... 𝓼𝓽𝓾𝓭"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.46,
      "title": "Grease",
      "year": 1978
    },
    {
      "letterboxdRating": 3.58,
      "letterboxdSlug": "the-double-2013",
      "topReviews": [
        {
          "text": "i feel like jesse eisenberg did this movie because he was jealous that armie hammer got cloned in the social network (2010) and he didn’t"
        },
        {
          "text": "this whole movie feels like when you tell a joke and no one hears it but then someone repeats it louder and everyone laughs"
        },
        {
          "text": "\"I like to think I'm pretty unique.\" I have a theory. You know what that means? It's time for Silly Psychoanalysis with Screening Notes! Everybody get your Silly Theory Hats on! I'm going to be analyz..."
        },
        {
          "text": "take Dostoyevsky, add 1 part Gilliam, 1 part Tati & a thimble of early Woody Allen. stir to near-perfection. i wasn't impressed by the instantly forgettable SUBMARINE, but Ayoade wows here, bending th..."
        },
        {
          "text": "The Double is an Orwellian nightmare, doused in sickly artificial light and imbued with delightfully awkward absurdism. Ayoade has crafted a film that feels like a scrapbook of his influences all blen..."
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.42,
      "title": "The Double",
      "year": 2013
    },
    {
      "letterboxdRating": 3.59,
      "letterboxdSlug": "big",
      "topReviews": [
        {
          "text": "If you skip the first 20 minutes of the movie, it's just the story of an autistic man overcoming his hardships in the workplace."
        },
        {
          "text": "This falls under the category of \"fun 80s movies that become INSANELY uncomfortable if you think about it for too long\""
        },
        {
          "text": "It's weird that he and Elizabeth Perkins have sex."
        },
        {
          "text": "imagine this movie from the mom’s perspective."
        },
        {
          "text": "watching this movie for the first time in 2018 is BONKERS. i really dug it but soooo much of the comedy is actually horrifying and so much of the sentimentality is actually hilarious. what a trip. the..."
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.4100000000000001,
      "title": "Big",
      "year": 1988
    },
    {
      "letterboxdRating": 3.6,
      "letterboxdSlug": "bridge-of-spies",
      "topReviews": [
        {
          "text": "i will never forgive Spielberg for not calling this movie SALMON FISHING IN BERLIN. but it's very good. if there's any movie at NYFF that *should* have been written by Aaron Sorkin... not that the Coe..."
        },
        {
          "text": "do you think they set out to make this dull as fuck or was it an accident"
        },
        {
          "text": "Think it was Dargis who pointed out this great quote from John Le Carré: \"for how long can we defend ourselves by methods of this kind, and still remain the kind of society that is worth defending?\" a..."
        },
        {
          "text": "huge representation for the “a little sick and wants to go home” community"
        },
        {
          "text": "the movie truly did deliver on its title. there really was a bridge of spies 😌"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.4,
      "title": "Bridge of Spies",
      "year": 2015
    }
  ],
  "overrated": [
    {
      "letterboxdRating": 4.08,
      "letterboxdSlug": "the-thin-red-line",
      "topReviews": [
        {
          "text": "I heard people talk about immortality, but I ain't seen it. l wondered how it'd be when l died. What it'd be like to know that this breath now was the last one you was ever gonna draw. l just hope l c..."
        },
        {
          "text": "Nature as witness to men's destruction. Trees as tombstones circling us, venomous snakes interrupting gun battles, shy plants withdrawing from a soldier's touch. Sunlight piercing through layers of gr..."
        },
        {
          "text": "The moment Terrence Malick realized voiceover narration could be whispered"
        },
        {
          "text": "Terrence Malick was definitely the type of kid that would’ve gotten distracted by a butterfly in the middle of a soccer game. My thoughts while watching the movie: “Wait is that John Travolta?” “Wait ..."
        },
        {
          "text": "As the next installment in our unofficial Malick festival, we revisited THE THIN RED LINE last night. This was the first Malick film I ever saw, and I'd never seen anything like it. This is a movie in..."
        }
      ],
      "userRating": 1,
      "ratingDiff": -3.08,
      "title": "The Thin Red Line",
      "year": 1998
    },
    {
      "letterboxdRating": 3.53,
      "letterboxdSlug": "death-of-a-salesman",
      "topReviews": [
        {
          "text": "I think this would’ve been a lot more enjoyable to watch if I didn’t have to do like 12 essays on it"
        },
        {
          "text": "The most interesting thing about this half baked adaptation is seeing John Malkovich when he had hair."
        },
        {
          "text": "\"Will you take that phony dream and burn it before something happens?\" The initial entry in Volker Schlöndorff's vicissitudinous stateside output is a foursquare television adaptation of Arthur Miller..."
        },
        {
          "text": "young john malkovich hot? feeling confused"
        },
        {
          "text": "I've never seen a film better capture the intimacy and immediacy of a stage performance."
        }
      ],
      "userRating": 1,
      "ratingDiff": -2.53,
      "title": "Death of a Salesman",
      "year": 1985
    },
    {
      "letterboxdRating": 4.4,
      "letterboxdSlug": "barry-lyndon",
      "topReviews": [
        {
          "text": "Showed this to my mom today. She thinks 2001: A Space Odyssey is the most boring film of all time, she walked out of A Clockwork Orange and she never ceases to complain about every aspect in Dr. Stran..."
        },
        {
          "text": "marie antoinette for fellas"
        },
        {
          "text": "One of the most interesting things about Barry Lyndon is that he's boring. He's a bit stupid - but not enough for me to feel sorry for him; he's a bit pompous - but not enough for me to hate him; he's..."
        },
        {
          "text": "if i lived in the 1700s i too would just go on absolutely every side mission imaginable"
        },
        {
          "text": "I maintain now and always that this is one of the great comedies, a slow burn of greed, cowardice and arrogance that depicts an aristocratic structure that creates arbitrary divisions among European n..."
        }
      ],
      "userRating": 2,
      "ratingDiff": -2.4000000000000004,
      "title": "Barry Lyndon",
      "year": 1975
    },
    {
      "letterboxdRating": 4.36,
      "letterboxdSlug": "se7en",
      "topReviews": [
        {
          "text": "KEVIN SPACEY GIVES BRAD PITT HEAD !!! *NO CLICKBAIT*"
        },
        {
          "text": "se7en's ending scene is by far my favorite unboxing video on youtube"
        },
        {
          "text": "I recently watched a mini-doc on David Fincher's film techniques. One of the scenes that's mentioned is the famous \"box\" scene. When he filmed Brad Pitt and Morgan Freeman, he used a handheld camera a..."
        },
        {
          "text": "my mom said that this is the scariest film shes ever seen and she saw it while she was pregnant with me, and im 100% convinced she could have gone into stress-induced labor during the opening credits ..."
        },
        {
          "text": "someone: *makes a good witty comeback* bread poot: sit back you fucking freak shut your fucking mouth you're a movie of the week you're a fucking t-shirt at best"
        }
      ],
      "userRating": 2,
      "ratingDiff": -2.3600000000000003,
      "title": "Se7en",
      "year": 1995
    },
    {
      "letterboxdRating": 3.32,
      "letterboxdSlug": "pretty-in-pink",
      "topReviews": [
        {
          "text": "some of y’all actually believe that duckie was straight ?? i have to laugh"
        },
        {
          "text": "what a fucking awful dress"
        },
        {
          "text": "that scene where the lovable duckie dale slides into the record store and dances/lip syncs to try a little tenderness by otis redding will forever be one of the most iconic moments in cinematic histor..."
        },
        {
          "text": "Young, stupid brain: Andie should end up with Duckie because he's the only halfway decent guy in the whole movie. And he does the Kenny Ortega lip-sync dance really well. Grown-up, normal brain : Andi..."
        },
        {
          "text": "I still don't get how we're supposed to feel bad for Duckie when he's really intolerable???"
        }
      ],
      "userRating": 1,
      "ratingDiff": -2.32,
      "title": "Pretty in Pink",
      "year": 1986
    },
    {
      "letterboxdRating": 3.25,
      "letterboxdSlug": "redacted",
      "topReviews": [
        {
          "text": "\"What do ya'll think is gonna be the first casualty of this entire conflict....it's gonna be the truth.\" Just notes: Not an addiction to images, but an addiction to image making. The perfect example o..."
        },
        {
          "text": "“It’s impolite to stare.” When we’re talking about filmmakers who have bailed on the present versus those who meet it head on, spill one out for BDP, the only surviving New Hollywooder who would, coul..."
        },
        {
          "text": "are you not supporting the troops? although the plot points come directly from another one of his films, this has much of the same effect as Hi Mom! - Brian De Palma the political ironist at his best...."
        },
        {
          "text": "Basically a Casualties of War remake but this time it’s found footage and also very bad"
        },
        {
          "text": "fascinating/horrifying use of the mockumentary format (blogs, amateur camcorders, night vision, security cams, simultaneously creating digital distance and formal intimacy) and as far as american depi..."
        }
      ],
      "userRating": 1,
      "ratingDiff": -2.25,
      "title": "Redacted",
      "year": 2007
    },
    {
      "letterboxdRating": 4.22,
      "letterboxdSlug": "the-truman-show",
      "topReviews": [
        {
          "text": "if i lived in a town where everyone looked like a republican i'd wanna leave too"
        },
        {
          "text": "The most fun and lighthearted horror movie ever made"
        },
        {
          "text": "worried for the guy taking the longest bath of all time"
        },
        {
          "text": "the more i think about the ending, the more i feel bad for truman. the way he’s entering a world where he expects to finally be free and in charge of his own destiny, but is actually entering an envir..."
        },
        {
          "text": "the truman show was black mirror before black mirror was black mirror"
        }
      ],
      "userRating": 2,
      "ratingDiff": -2.2199999999999998,
      "title": "The Truman Show",
      "year": 1998
    },
    {
      "letterboxdRating": 4.11,
      "letterboxdSlug": "the-royal-tenenbaums",
      "topReviews": [
        {
          "text": "“I’m sorry for your loss. Your mother was a terribly attractive woman.”"
        },
        {
          "text": "\"I've had a rough year, dad.\" WES ANDERSON WANTS ME DEAD"
        },
        {
          "text": "The scene with Richie Tenenbaum in the bathroom while Needle in the Hay plays....powerful stuff. It gives me chills every time"
        },
        {
          "text": "ok so i read an article about the tenenbaum children and it theorized that when they become adults and grow apart they start to realize that they're actually not as special as they thought they were w..."
        },
        {
          "text": "put them and the roy siblings in a room together let’s see what happens"
        }
      ],
      "userRating": 2,
      "ratingDiff": -2.1100000000000003,
      "title": "The Royal Tenenbaums",
      "year": 2001
    },
    {
      "letterboxdRating": 3.01,
      "letterboxdSlug": "here-2024",
      "topReviews": [
        {
          "text": "My favorite parts of Robert Zemeckis’ Here 3. Benjamin Franklin 2. Dinosaurs 1. The inventor of the La-Z Boy and his sexy wife, the true stars of the film, the entire thing should’ve just been about t..."
        },
        {
          "text": "93 I usually try not to bother with the reception of a new release, but it's a bit disconcerting to see such a furious and mean-spirited response towards an ambitious film from one of cinema's greates..."
        },
        {
          "text": "The way I didn’t care about anything"
        },
        {
          "text": "would maybe be insanely good if it wasn't just Boomer Diorama"
        },
        {
          "text": "ingenious concept, mediocre execution, worst screenplay of the last several years. what else do you give that but a perfectly balanced 2.5 stars."
        }
      ],
      "userRating": 1,
      "ratingDiff": -2.01,
      "title": "Here",
      "year": 2024
    },
    {
      "letterboxdRating": 4.01,
      "letterboxdSlug": "the-lighthouse-2019",
      "topReviews": [
        {
          "text": "idiots will call this a staggering retelling of the myth of prometheus through the eyes of the american laborer, the fire of the gods becoming success under capitalism, an unattainable fiction that dr..."
        },
        {
          "text": "not a cell phone in sight. just guys being dudes"
        },
        {
          "text": "dinner with papaw tonight...❤️ he made 12 lobsters for all 6 wickies and only one showed. 😢 love him"
        },
        {
          "text": "Robert Eggers drenched in sweat running to his desk, scratching down quickly in his notebook only this: mussy (mermaid pussy)"
        },
        {
          "text": "thomas : yer fond of me lobster ain’t ye??? 😢 winslow : are ye in the right headspace to receive information that could possibly hurt ye"
        }
      ],
      "userRating": 2,
      "ratingDiff": -2.01,
      "title": "The Lighthouse",
      "year": 2019
    }
  ],
  "allResults": {
    "Death of a Salesman (1985)": {
      "letterboxdRating": 3.53,
      "letterboxdSlug": "death-of-a-salesman",
      "topReviews": [
        {
          "text": "I think this would’ve been a lot more enjoyable to watch if I didn’t have to do like 12 essays on it"
        },
        {
          "text": "The most interesting thing about this half baked adaptation is seeing John Malkovich when he had hair."
        },
        {
          "text": "\"Will you take that phony dream and burn it before something happens?\" The initial entry in Volker Schlöndorff's vicissitudinous stateside output is a foursquare television adaptation of Arthur Miller..."
        },
        {
          "text": "young john malkovich hot? feeling confused"
        },
        {
          "text": "I've never seen a film better capture the intimacy and immediacy of a stage performance."
        }
      ],
      "userRating": 1,
      "ratingDiff": -2.53,
      "title": "Death of a Salesman",
      "year": 1985
    },
    "Brothers (2024)": {
      "letterboxdRating": 2.33,
      "letterboxdSlug": "brothers-2024",
      "topReviews": [
        {
          "text": "Surprisingly forgettable for something with a cast/creative team of this caliber; Max Barbakow killed it with Palm Springs , but Macon Blair’s script doesn’t give him much to work with here and, other..."
        },
        {
          "text": "that orangutan is horny af"
        },
        {
          "text": "when i said that i wanted to see brendan fraser booked and busy this was not what i meant"
        },
        {
          "text": "One of those movies that isn’t that bad but you forget about it in a few days. Waste of a very stacked cast, even though I did actually enjoy Brenden Fraser in this role. He was the one big highlight ..."
        },
        {
          "text": "The second wild, unexpected Glenn Close sighting of 2024."
        }
      ],
      "userRating": 1,
      "ratingDiff": -1.33,
      "title": "Brothers",
      "year": 2024
    },
    "Redacted (2007)": {
      "letterboxdRating": 3.25,
      "letterboxdSlug": "redacted",
      "topReviews": [
        {
          "text": "\"What do ya'll think is gonna be the first casualty of this entire conflict....it's gonna be the truth.\" Just notes: Not an addiction to images, but an addiction to image making. The perfect example o..."
        },
        {
          "text": "“It’s impolite to stare.” When we’re talking about filmmakers who have bailed on the present versus those who meet it head on, spill one out for BDP, the only surviving New Hollywooder who would, coul..."
        },
        {
          "text": "are you not supporting the troops? although the plot points come directly from another one of his films, this has much of the same effect as Hi Mom! - Brian De Palma the political ironist at his best...."
        },
        {
          "text": "Basically a Casualties of War remake but this time it’s found footage and also very bad"
        },
        {
          "text": "fascinating/horrifying use of the mockumentary format (blogs, amateur camcorders, night vision, security cams, simultaneously creating digital distance and formal intimacy) and as far as american depi..."
        }
      ],
      "userRating": 1,
      "ratingDiff": -2.25,
      "title": "Redacted",
      "year": 2007
    },
    "The Thin Red Line (1998)": {
      "letterboxdRating": 4.08,
      "letterboxdSlug": "the-thin-red-line",
      "topReviews": [
        {
          "text": "I heard people talk about immortality, but I ain't seen it. l wondered how it'd be when l died. What it'd be like to know that this breath now was the last one you was ever gonna draw. l just hope l c..."
        },
        {
          "text": "Nature as witness to men's destruction. Trees as tombstones circling us, venomous snakes interrupting gun battles, shy plants withdrawing from a soldier's touch. Sunlight piercing through layers of gr..."
        },
        {
          "text": "The moment Terrence Malick realized voiceover narration could be whispered"
        },
        {
          "text": "Terrence Malick was definitely the type of kid that would’ve gotten distracted by a butterfly in the middle of a soccer game. My thoughts while watching the movie: “Wait is that John Travolta?” “Wait ..."
        },
        {
          "text": "As the next installment in our unofficial Malick festival, we revisited THE THIN RED LINE last night. This was the first Malick film I ever saw, and I'd never seen anything like it. This is a movie in..."
        }
      ],
      "userRating": 1,
      "ratingDiff": -3.08,
      "title": "The Thin Red Line",
      "year": 1998
    },
    "Here (2024)": {
      "letterboxdRating": 3.01,
      "letterboxdSlug": "here-2024",
      "topReviews": [
        {
          "text": "My favorite parts of Robert Zemeckis’ Here 3. Benjamin Franklin 2. Dinosaurs 1. The inventor of the La-Z Boy and his sexy wife, the true stars of the film, the entire thing should’ve just been about t..."
        },
        {
          "text": "93 I usually try not to bother with the reception of a new release, but it's a bit disconcerting to see such a furious and mean-spirited response towards an ambitious film from one of cinema's greates..."
        },
        {
          "text": "The way I didn’t care about anything"
        },
        {
          "text": "would maybe be insanely good if it wasn't just Boomer Diorama"
        },
        {
          "text": "ingenious concept, mediocre execution, worst screenplay of the last several years. what else do you give that but a perfectly balanced 2.5 stars."
        }
      ],
      "userRating": 1,
      "ratingDiff": -2.01,
      "title": "Here",
      "year": 2024
    },
    "Sex Appeal (2022)": {
      "letterboxdRating": 2.15,
      "letterboxdSlug": "sexappeal",
      "topReviews": [
        {
          "text": "enjoyable bc i don’t have the mindset of a filmbro"
        },
        {
          "text": "literally the only thing i needed tonight was a stupid little rom com happy ending and this did not deliver 🙄 tired of the life lessons! give me illogical romance!"
        },
        {
          "text": "Nice to know Hulu can also make a shitty Netflix original movie"
        },
        {
          "text": "in the words of twsift “i’ve never heard silence quite this loud”"
        },
        {
          "text": "I can’t believe I’m feeling things for Fletcher from ANT Farm"
        }
      ],
      "userRating": 1,
      "ratingDiff": -1.15,
      "title": "Sex Appeal",
      "year": 2022
    },
    "Pretty in Pink (1986)": {
      "letterboxdRating": 3.32,
      "letterboxdSlug": "pretty-in-pink",
      "topReviews": [
        {
          "text": "some of y’all actually believe that duckie was straight ?? i have to laugh"
        },
        {
          "text": "what a fucking awful dress"
        },
        {
          "text": "that scene where the lovable duckie dale slides into the record store and dances/lip syncs to try a little tenderness by otis redding will forever be one of the most iconic moments in cinematic histor..."
        },
        {
          "text": "Young, stupid brain: Andie should end up with Duckie because he's the only halfway decent guy in the whole movie. And he does the Kenny Ortega lip-sync dance really well. Grown-up, normal brain : Andi..."
        },
        {
          "text": "I still don't get how we're supposed to feel bad for Duckie when he's really intolerable???"
        }
      ],
      "userRating": 1,
      "ratingDiff": -2.32,
      "title": "Pretty in Pink",
      "year": 1986
    },
    "Horizon: An American Saga – Chapter 1 (2024)": {
      "letterboxdRating": 3.01,
      "letterboxdSlug": "horizon-an-american-saga-chapter-1",
      "topReviews": [
        {
          "text": "I promise i’m not insane for calling this normie dad twin peaks the return"
        },
        {
          "text": "History Channel slop. And while I admire the ambition, this is nothing more than an embarrassing vanity project. This is television, plain and simple, from the look, to the pace, to the performances––..."
        },
        {
          "text": "70 Only Kevin Costner would release a three hour film that is essentially a mere 25% piece of the full picture just to spite the producers of Yellowstone. You see this miniseries I'm making? Paramount..."
        },
        {
          "text": "Was not crazy about this but then it ends with a montage that's really just a trailer for Part 2 and I can't lie, it looked cool. You got me, Costner."
        },
        {
          "text": "john wayne would’ve loved this (derogatory)"
        }
      ],
      "userRating": 2,
      "ratingDiff": -1.0099999999999998,
      "title": "Horizon: An American Saga – Chapter 1",
      "year": 2024
    },
    "Mr. & Mrs. Smith (2005)": {
      "letterboxdRating": 3.3,
      "letterboxdSlug": "mr-mrs-smith-2005",
      "topReviews": [
        {
          "text": "there's so much i could say about this but damn i love being bisexual"
        },
        {
          "text": "angelina \"who's your daddy now\" jolie in a dominatrix outfit, sliding down a building, and hailing a cab, is the most iconic scene in the history of cinema"
        },
        {
          "text": "\"John, my parents? They died when I was five, I'm an orphan.\" \"Who was that kindly fellow who gave you away at our wedding?\" \"A paid actor...\" \"I said, I SAID I saw your dad on fantasy island!!!\""
        },
        {
          "text": "I can’t believe Adam Brody’s character is wearing a fight club tshirt while he’s being interrogated by Brad Pitt"
        },
        {
          "text": "Angelina screaming pussy single handedly saved the film industry"
        }
      ],
      "userRating": 2,
      "ratingDiff": -1.2999999999999998,
      "title": "Mr. & Mrs. Smith",
      "year": 2005
    },
    "Juror #2 (2024)": {
      "letterboxdRating": 3.38,
      "letterboxdSlug": "juror-2",
      "topReviews": [
        {
          "text": "I loved when Toni Collette googled the wife’s name + “husband” and multiple photos of them together showed up"
        },
        {
          "text": "halfway through my mom goes “wait should we have started with the first one?” and i was like “what are you talking about” and she says “juror #1?” and my sister goes “mom it’s called juror #2 because ..."
        },
        {
          "text": "Anatomy of a vehicular manslaughter (2024)"
        },
        {
          "text": "personally i would have shut the fuck up"
        },
        {
          "text": "me when my parents blamed my brother for the window I broke when I was seven"
        }
      ],
      "userRating": 2,
      "ratingDiff": -1.38,
      "title": "Juror #2",
      "year": 2024
    },
    "Se7en (1995)": {
      "letterboxdRating": 4.36,
      "letterboxdSlug": "se7en",
      "topReviews": [
        {
          "text": "KEVIN SPACEY GIVES BRAD PITT HEAD !!! *NO CLICKBAIT*"
        },
        {
          "text": "se7en's ending scene is by far my favorite unboxing video on youtube"
        },
        {
          "text": "I recently watched a mini-doc on David Fincher's film techniques. One of the scenes that's mentioned is the famous \"box\" scene. When he filmed Brad Pitt and Morgan Freeman, he used a handheld camera a..."
        },
        {
          "text": "my mom said that this is the scariest film shes ever seen and she saw it while she was pregnant with me, and im 100% convinced she could have gone into stress-induced labor during the opening credits ..."
        },
        {
          "text": "someone: *makes a good witty comeback* bread poot: sit back you fucking freak shut your fucking mouth you're a movie of the week you're a fucking t-shirt at best"
        }
      ],
      "userRating": 2,
      "ratingDiff": -2.3600000000000003,
      "title": "Se7en",
      "year": 1995
    },
    "The Fabelmans (2022)": {
      "letterboxdRating": 4,
      "letterboxdSlug": "the-fabelmans",
      "topReviews": [
        {
          "text": "God I'm so mad I never thought of teen Spielberg's trick where he rigs a wooden board on a lever to simulate dirt explosions when he's shooting his war movie but then I also have to remember that he's..."
        },
        {
          "text": "Film students watching this and being like “he just like me fr”"
        },
        {
          "text": "So glad he got to meet the greatest film director of all time, David Lynch."
        },
        {
          "text": "goes above and beyond what you normally expect from a movie about movies. cheesy and over-sentimental at times but i wouldn’t want it any other way. if this is spielberg’s last i cannot think of a bet..."
        },
        {
          "text": "Imagine getting cucked by Seth Rogen"
        }
      ],
      "userRating": 2,
      "ratingDiff": -2,
      "title": "The Fabelmans",
      "year": 2022
    },
    "She Said (2022)": {
      "letterboxdRating": 3.57,
      "letterboxdSlug": "she-said-2022",
      "topReviews": [
        {
          "text": "It’s disheartening to give a film like She Said a negative rating, even if it’s honest - this is something that affected real women, and resulted from a corrupt and abusive system in Hollywood (and ev..."
        },
        {
          "text": "90% of this movie are cell phones ringing and it’s great"
        },
        {
          "text": "Produced by Brad Pitt? Lol. Ok. That’s a rather unfortunate and ironic blemish this otherwise excellent movie has to deal with isn’t it? Excellent story, told exceptionally well with superb performanc..."
        },
        {
          "text": "She Said is not only one of the best films of the year, but also an essential example of how important it is that women tell women’s stories, and a riveting reminder that it was two working moms who t..."
        },
        {
          "text": "Well-intentioned but leaves a lot to be desired both in the writing and behind the camera. An undeniably important story to be told but there has to be a better way to express it cinematically than th..."
        }
      ],
      "userRating": 2,
      "ratingDiff": -1.5699999999999998,
      "title": "She Said",
      "year": 2022
    },
    "The Gorge (2025)": {
      "letterboxdRating": 2.94,
      "letterboxdSlug": "the-gorge-2025",
      "topReviews": [
        {
          "text": "I feel like you’re just here for the zip line"
        },
        {
          "text": "don't ask me anything about the plot, i couldn't take my eyes off Anya she's so gorge ous"
        },
        {
          "text": "hey, i saw you from across the gorge and really dug your vibe."
        },
        {
          "text": "You Belong With Me music video extended cut"
        },
        {
          "text": "I liked the part where Whiplash and Queen’s Gambit teamed up"
        }
      ],
      "userRating": 2,
      "ratingDiff": -0.94,
      "title": "The Gorge",
      "year": 2025
    },
    "The Scarecrow (1920)": {
      "letterboxdRating": 3.88,
      "letterboxdSlug": "the-scarecrow",
      "topReviews": [
        {
          "text": "buster keaton lives in the ultimate quirky bachelor pad, has pigs and ducks hanging out right outside his door, shakes hands with a rabid dog, gets married while driving a motorcycle; this guy is the ..."
        },
        {
          "text": "I think this is the only comedy I’ve seen where the majority of the jokes come from the production design. Buster rules."
        },
        {
          "text": "Cinematic Time Capsule 1920 Marathon - Film #44 ”All the rooms in this house are in one room.” Welcome to small space living, 1920 style, as Buster Keaton and Joe Roberts front pack this short with an..."
        },
        {
          "text": "The first six minutes aren’t so much funny as they are one of the most staggeringly inventive sequences I’ve ever seen in a movie. Jaw on the floor, tempted to give a standing ovation watching this th..."
        },
        {
          "text": "I am once again convinced that Buster Keaton was the most perfect and best silent era actor/performer."
        }
      ],
      "userRating": 2,
      "ratingDiff": -1.88,
      "title": "The Scarecrow",
      "year": 1920
    },
    "The 40 Year Old Virgin (2005)": {
      "letterboxdRating": 3.33,
      "letterboxdSlug": "the-40-year-old-virgin",
      "topReviews": [
        {
          "text": "this must be the scariest horror film to straight white men"
        },
        {
          "text": "Why did it turn into Midsommar at the end 74%"
        },
        {
          "text": "AGGRESSIVELY 2005"
        },
        {
          "text": "I respect women so much that I stay away from them completely"
        },
        {
          "text": "The ending to this is so weird but literally my favourite thing"
        }
      ],
      "userRating": 2,
      "ratingDiff": -1.33,
      "title": "The 40 Year Old Virgin",
      "year": 2005
    },
    "The Truman Show (1998)": {
      "letterboxdRating": 4.22,
      "letterboxdSlug": "the-truman-show",
      "topReviews": [
        {
          "text": "if i lived in a town where everyone looked like a republican i'd wanna leave too"
        },
        {
          "text": "The most fun and lighthearted horror movie ever made"
        },
        {
          "text": "worried for the guy taking the longest bath of all time"
        },
        {
          "text": "the more i think about the ending, the more i feel bad for truman. the way he’s entering a world where he expects to finally be free and in charge of his own destiny, but is actually entering an envir..."
        },
        {
          "text": "the truman show was black mirror before black mirror was black mirror"
        }
      ],
      "userRating": 2,
      "ratingDiff": -2.2199999999999998,
      "title": "The Truman Show",
      "year": 1998
    },
    "The Royal Tenenbaums (2001)": {
      "letterboxdRating": 4.11,
      "letterboxdSlug": "the-royal-tenenbaums",
      "topReviews": [
        {
          "text": "“I’m sorry for your loss. Your mother was a terribly attractive woman.”"
        },
        {
          "text": "\"I've had a rough year, dad.\" WES ANDERSON WANTS ME DEAD"
        },
        {
          "text": "The scene with Richie Tenenbaum in the bathroom while Needle in the Hay plays....powerful stuff. It gives me chills every time"
        },
        {
          "text": "ok so i read an article about the tenenbaum children and it theorized that when they become adults and grow apart they start to realize that they're actually not as special as they thought they were w..."
        },
        {
          "text": "put them and the roy siblings in a room together let’s see what happens"
        }
      ],
      "userRating": 2,
      "ratingDiff": -2.1100000000000003,
      "title": "The Royal Tenenbaums",
      "year": 2001
    },
    "Barry Lyndon (1975)": {
      "letterboxdRating": 4.4,
      "letterboxdSlug": "barry-lyndon",
      "topReviews": [
        {
          "text": "Showed this to my mom today. She thinks 2001: A Space Odyssey is the most boring film of all time, she walked out of A Clockwork Orange and she never ceases to complain about every aspect in Dr. Stran..."
        },
        {
          "text": "marie antoinette for fellas"
        },
        {
          "text": "One of the most interesting things about Barry Lyndon is that he's boring. He's a bit stupid - but not enough for me to feel sorry for him; he's a bit pompous - but not enough for me to hate him; he's..."
        },
        {
          "text": "if i lived in the 1700s i too would just go on absolutely every side mission imaginable"
        },
        {
          "text": "I maintain now and always that this is one of the great comedies, a slow burn of greed, cowardice and arrogance that depicts an aristocratic structure that creates arbitrary divisions among European n..."
        }
      ],
      "userRating": 2,
      "ratingDiff": -2.4000000000000004,
      "title": "Barry Lyndon",
      "year": 1975
    },
    "Clerks II (2006)": {
      "letterboxdRating": 3.28,
      "letterboxdSlug": "clerks-ii",
      "topReviews": [
        {
          "text": "12 It's almost comical how terrible Clerks II is compared to the original film. Clerks at least had the decency to productively convey working-class malaise and the stagnation of pop-culture. The Quic..."
        },
        {
          "text": "And then right after the Sam-Frodo suckfest, right before the credits roll, Sam fucking flat-out BRICKS in Frodo’s mouth"
        },
        {
          "text": "honestly, clerks II isn't even a real movie it's just a big joke that kevin smith cleverly concocted somehow. from the ABC scene that makes absolutely no sense and has little to no context to kinky ke..."
        },
        {
          "text": "kevin smith movies are like those paintings dementia patients do where you can see their condition slowly worsening"
        },
        {
          "text": "\"Pillow pants is her pussy troll. Duh!\" Well, there's something I didn't think I'd be hearing today. Or ever."
        }
      ],
      "userRating": 2,
      "ratingDiff": -1.2799999999999998,
      "title": "Clerks II",
      "year": 2006
    },
    "The Lighthouse (2019)": {
      "letterboxdRating": 4.01,
      "letterboxdSlug": "the-lighthouse-2019",
      "topReviews": [
        {
          "text": "idiots will call this a staggering retelling of the myth of prometheus through the eyes of the american laborer, the fire of the gods becoming success under capitalism, an unattainable fiction that dr..."
        },
        {
          "text": "not a cell phone in sight. just guys being dudes"
        },
        {
          "text": "dinner with papaw tonight...❤️ he made 12 lobsters for all 6 wickies and only one showed. 😢 love him"
        },
        {
          "text": "Robert Eggers drenched in sweat running to his desk, scratching down quickly in his notebook only this: mussy (mermaid pussy)"
        },
        {
          "text": "thomas : yer fond of me lobster ain’t ye??? 😢 winslow : are ye in the right headspace to receive information that could possibly hurt ye"
        }
      ],
      "userRating": 2,
      "ratingDiff": -2.01,
      "title": "The Lighthouse",
      "year": 2019
    },
    "Slackers (2002)": {
      "letterboxdRating": 2.58,
      "letterboxdSlug": "slackers",
      "topReviews": [
        {
          "text": "STARRING: THE QUIRKY, DEADPAN JASON SCHWARTZMAN (THE COPPOLA SAGA) Known for his collaboration with Wes Anderson, bringing such a low-key quirkiness but also an aura of his own, Jason Schwartzman has ..."
        },
        {
          "text": "I think the director was torn between making a psychological thriller or a boner comedy."
        },
        {
          "text": "Everything about this is horrifyingly awful, and Jason Schwartzman is really the only one trying here. He’s almost too good at playing annoying nerds. I do have to thank this movie for reminding me ho..."
        },
        {
          "text": "This isn't good but Jason Schwartzman is"
        },
        {
          "text": "idk if i liked this or not some of it made me wanna kill myself"
        }
      ],
      "userRating": 2,
      "ratingDiff": -0.5800000000000001,
      "title": "Slackers",
      "year": 2002
    },
    "The Accountant² (2025)": {
      "letterboxdRating": 3.1,
      "letterboxdSlug": "the-accountant-2025",
      "topReviews": [
        {
          "text": "the accountant 3 should be about ben affleck and the autism academy vs. rfk jr"
        },
        {
          "text": "that Jon Bernthal freeze frame gag is something special man"
        },
        {
          "text": "Alarmingly weird and funny in a way that completely eluded the first one, still prime Dad Movie stuff. Basically zero accounting though."
        },
        {
          "text": "God the genuine pride and love on Jon Bernthal’s face when he sees Affleck line dancing and shouts “that’s my big brother!” This is why we go to the movies Please make a hundred more of these"
        },
        {
          "text": "The only sensible direction for the Accountant to go was bigger and more ridiculous and I am so glad they did exactly that, deeply silly movie, Affleck and Bernthal are a match made in heaven"
        }
      ],
      "userRating": 2,
      "ratingDiff": -1.1,
      "title": "The Accountant²",
      "year": 2025
    },
    "Sweet Home Alabama (2002)": {
      "letterboxdRating": 2.83,
      "letterboxdSlug": "sweet-home-alabama",
      "topReviews": [
        {
          "text": "patrick dempsey: -a democrat -against the confederacy -a good person -good to reese -isn't from the south jake: -a confederate -wouldn't divorce reese for 7 YEARS -made her feel like a bad person for ..."
        },
        {
          "text": "What if you met someone and they were like \"my favorite movie is sweet home Alabama.\""
        },
        {
          "text": "maybe im redneckophobic but WHO would leave millionaire patrick dempsey from new york at the altar for a redneck? NOT ME."
        },
        {
          "text": "YOU MARRIED YOUR COUSIN 🤨⁉️"
        },
        {
          "text": "bit disappointed they didn’t get struck by lightning at the end , cos i’m a sucker for circular narratives"
        }
      ],
      "userRating": 2,
      "ratingDiff": -0.8300000000000001,
      "title": "Sweet Home Alabama",
      "year": 2002
    },
    "Little Fockers (2010)": {
      "letterboxdRating": 2.48,
      "letterboxdSlug": "little-fockers",
      "topReviews": [
        {
          "text": "There's a scene where De Niro has taken a tablet to maintain an erection. Unfortunately for him, it continues long after he needs. He asks his nurse son-in-law, Stiller, to administer an injection to ..."
        },
        {
          "text": "contains one of the most profound thematic trends found in modern life: Not Enough Laura Dern"
        },
        {
          "text": "This focking sucks shit."
        },
        {
          "text": "LMAO WHY IS NICK KROLL AN EXTRA IN THIS"
        },
        {
          "text": "I don’t know if anybody ever noticed this but the name Focker sounds like the word “fucker”"
        }
      ],
      "userRating": 2,
      "ratingDiff": -0.48,
      "title": "Little Fockers",
      "year": 2010
    },
    "Mountainhead (2025)": {
      "letterboxdRating": 2.54,
      "letterboxdSlug": "mountainhead",
      "topReviews": [
        {
          "text": "whole lotta mountain not a lotta head"
        },
        {
          "text": "Not remotely surprised that Jesse Armstrong decided to turn what was probably a Succession finale idea that got immediately shouted down in the writers' room into a movie Adam McKay would blame you fo..."
        },
        {
          "text": "kinda impressively bad. jesse armstrong's sell for mountainhead, his first project since succession, has been that he decided to \"run at it fast rather than stew on it for five years.” he would have b..."
        },
        {
          "text": "Where is Luigi Mangione when we need him most?"
        },
        {
          "text": "they should’ve invited kendall roy"
        }
      ],
      "userRating": 2,
      "ratingDiff": -0.54,
      "title": "Mountainhead",
      "year": 2025
    },
    "High Fidelity (2000)": {
      "letterboxdRating": null,
      "error": "curl failed: spawnSync /bin/sh ETIMEDOUT",
      "title": "High Fidelity",
      "year": 2000,
      "userRating": 2
    },
    "Snatch (2000)": {
      "letterboxdRating": null,
      "error": "curl failed: spawnSync /bin/sh ETIMEDOUT",
      "title": "Snatch",
      "year": 2000,
      "userRating": 2
    },
    "Days of Thunder (1990)": {
      "letterboxdRating": 3.14,
      "letterboxdSlug": "days-of-thunder",
      "topReviews": [
        {
          "text": "One of the greatest freeze-frame endings of all time."
        },
        {
          "text": "Where is the Top Gun-esque soundtrack packed with wall-to-wall bangers??? This desperately needs its own \"Take My Breath Away\" or \"Danger Zone.\" If anything \"Danger Zone\" makes MORE sense in this movi..."
        },
        {
          "text": "\"Control is an illusion you infantile egomaniac. Nobody knows what's gonna happen next; not on a freeway, not in an airplane, not inside our own bodies and certainly not on a racetrack with 40 other i..."
        },
        {
          "text": "I, too, am named Cole Trickle"
        },
        {
          "text": "there’s a scene where robert duvall gently caresses and gives a motivational speech to a race car and then the camera cuts to what I assume to be some type of car fluid leak on the ground which robert..."
        }
      ],
      "userRating": 2,
      "ratingDiff": -1.1400000000000001,
      "title": "Days of Thunder",
      "year": 1990
    },
    "The Fighter (2010)": {
      "letterboxdRating": 3.83,
      "letterboxdSlug": "the-fighter-2010",
      "topReviews": [
        {
          "text": "Knowing that Christian Bale is a method actor…. do you guys think he did crack a few times to prepare for this role?????"
        },
        {
          "text": "why didn't amy adams get an oscar for this? she had to pretend to be in love with mark wahlberg for two hours and k*ss him??? that's the most powerful performance and also the greatest acting i've eve..."
        },
        {
          "text": "i hate how good this was"
        },
        {
          "text": "I’m the guy behind Amy and Mark at the movie theatre talking about the cinematography"
        },
        {
          "text": "A film about the importance of family, even if they're literally the craziest motherfuckers to ever grace God's green earth."
        }
      ],
      "userRating": 2,
      "ratingDiff": -1.83,
      "title": "The Fighter",
      "year": 2010
    },
    "Mamma Mia! Here We Go Again (2018)": {
      "letterboxdRating": 3.45,
      "letterboxdSlug": "mamma-mia-here-we-go-again",
      "topReviews": [
        {
          "text": "This has MAJOR continuity issues and we know the younger cast members pale in comparison to the older ones but you know what? I DON’T CARE! Lily James cartwheeling all over a field for no apparent rea..."
        },
        {
          "text": "the fact that some of you are pretentious enough to walk into a movie musical sequel based on a literal broadway show with a plot told entirely through abba songs that stars cher to then walk out of i..."
        },
        {
          "text": "some girl in my theater when cher showed up in the trailer: “omg lady gaga??”"
        },
        {
          "text": "donna and the dynamos could defeat thanos"
        },
        {
          "text": "never gets old and neither does cher"
        }
      ],
      "userRating": 2,
      "ratingDiff": -1.4500000000000002,
      "title": "Mamma Mia! Here We Go Again",
      "year": 2018
    },
    "Prisoner of War (2025)": {
      "letterboxdRating": 2.84,
      "letterboxdSlug": "prisoner-of-war-2025",
      "topReviews": [
        {
          "text": "English Version below🟠🟢🔵 Double-Feature mit „Ein Crossover was ich niemals sehen wollte“ mit mir, Sammlung, Justus, Oliver und Histo und Glimmer Um meine Einleitung aufzugreifen: Ich bin und werde ..."
        },
        {
          "text": "New fetish unlocked: watching Scott Adkins whip some ass. — 2025 Ranked"
        },
        {
          "text": "About as good a movie as you could get out of Scott Adkins trying to escape from a Japanese POW camp that happens directed by his co-star from THE DEBT COLLECTORS. Truthfully, way more handsomely shot..."
        },
        {
          "text": "war bad. scott adkins fight good."
        },
        {
          "text": "Merry Christmas, Mr. Adkins! You thought Scott Adkins was going to rest on his laurels after releasing the best pure action movie of the year? That's just not Scott's style, so the 49 year-old actor i..."
        }
      ],
      "userRating": 2,
      "ratingDiff": -0.8399999999999999,
      "title": "Prisoner of War",
      "year": 2025
    },
    "Highest 2 Lowest (2025)": {
      "letterboxdRating": 2.81,
      "letterboxdSlug": "highest-2-lowest",
      "topReviews": [
        {
          "text": "Idk if I hate anything as much as Spike Lee hates Boston"
        },
        {
          "text": "I wasn’t sold on this until a$ap rocky said pussy in a way that had me lean forward"
        },
        {
          "text": "A pointless remake that does nothing but embarrass itself for most of it’s runtime. Kind of confused how someone as talented as Spike Lee was even behind this. I don't think they ever knew what this w..."
        },
        {
          "text": "Spike sure made a lot of choices here and some work and some really do not but they’re all interesting But also truly what is up with the score"
        },
        {
          "text": "dug this, but I wonder if I would’ve really loved it if i hadn’t watched High and Low in the same week. largely sublimates its politics/themes and stumbles in trying to recreate some of its highlights..."
        }
      ],
      "userRating": 2,
      "ratingDiff": -0.81,
      "title": "Highest 2 Lowest",
      "year": 2025
    },
    "Silver Linings Playbook (2012)": {
      "letterboxdRating": 3.71,
      "letterboxdSlug": "silver-linings-playbook",
      "topReviews": [
        {
          "text": "jennifer lawrence: I slept with everyone at my office me: including the women? bradley cooper, moments later: including the women? me: ...it was only okay when I said it"
        },
        {
          "text": "“i love you, i knew it the minute i met you. i’m sorry it took so long for me to catch up. i just got stuck.”"
        },
        {
          "text": "i said whoever gave that dance a 4.8 YOUR MOMS A HOE"
        },
        {
          "text": "i hate the fact that you wore a football jersey to dinner because i hate football but you can fuck me if you turn the lights off"
        },
        {
          "text": "me and the bad bitch i pulled by being severely mentally ill"
        }
      ],
      "userRating": 2,
      "ratingDiff": -1.71,
      "title": "Silver Linings Playbook",
      "year": 2012
    },
    "Deep Impact (1998)": {
      "letterboxdRating": 2.94,
      "letterboxdSlug": "deep-impact",
      "topReviews": [
        {
          "text": "there’s a scene where a father and a daughter are on a beach together and out of nowhere the father just says “when you were a baby I once dropped you on your head” and then he pats the daughter on th..."
        },
        {
          "text": "Homer: Get out of there. My family needs to use your bomb shelter. Ned: I kind of figured this might happen, so I built the shelter big enough for both our families! Homer: No deal. Out."
        },
        {
          "text": "Honestly, Armageddon is over-the-top, dumber but a better fun movie, while Deep Impact is more melodramatic, grounded & had a little bit better science and it's also dumb but not nearly dumb enough to..."
        },
        {
          "text": "things armageddon (1998) did right: destroying paris things deep impact (1998) did wrong: not destroying paris"
        },
        {
          "text": "While not as over-the-top and as enjoyably ludicrous as the all-time banger Armageddon , Deep Impact is still a 90s disaster film so that classification alone makes it a must-watch in my book. It's mu..."
        }
      ],
      "userRating": 2,
      "ratingDiff": -0.94,
      "title": "Deep Impact",
      "year": 1998
    },
    "The Woman in Cabin 10 (2025)": {
      "letterboxdRating": 2.44,
      "letterboxdSlug": "the-woman-in-cabin-10",
      "topReviews": [
        {
          "text": "Do you think she knows the woman in the window? Or the woman in the yard? Or the girl on the train? The boy in the stri [yanked offstage with a comically large cane]"
        },
        {
          "text": "If you’re going to perpetrate a crime on your luxury yacht, maybe don’t invite an investigative journalist along for the ride"
        },
        {
          "text": "A movie about keira knightley being gaslit on a luxury yacht by every accent you can think of"
        },
        {
          "text": "More like diva in cabin 8"
        },
        {
          "text": "still not used to see keira knightley holding a cellphone"
        }
      ],
      "userRating": 2,
      "ratingDiff": -0.43999999999999995,
      "title": "The Woman in Cabin 10",
      "year": 2025
    },
    "Not Okay (2022)": {
      "letterboxdRating": 2.83,
      "letterboxdSlug": "not-okay",
      "topReviews": [
        {
          "text": "Love Dylan O'Brien's performance as Pete Davidson in this movie"
        },
        {
          "text": "This is kinda like when I lied to my trivia group about having my masters degree"
        },
        {
          "text": "this movie gave us a dylan o’brien sex scene but at WHAT COST"
        },
        {
          "text": ". No wonder, she has a black swan poster in the room."
        },
        {
          "text": "the actress who plays rowan deserves a booked and busy future she was the best thing about this"
        }
      ],
      "userRating": 2,
      "ratingDiff": -0.8300000000000001,
      "title": "Not Okay",
      "year": 2022
    },
    "Hitchcock (2012)": {
      "letterboxdRating": 3.1,
      "letterboxdSlug": "hitchcock",
      "topReviews": [
        {
          "text": "Actual dialog from the film Hitchcock Hitchcock: In my thirty years as a director I have never found a Hitchcock blonde more beautiful than you, Alma. Alma: Oh, I have been waiting for thirty years to..."
        },
        {
          "text": "If it's true that the casting of Hopkins as Hitchcock is as inspiring of a casting as Freeman as God/Mandela, unfortunately the material given to the actor simply isn't good enough to make a lasting e..."
        },
        {
          "text": "I'm just a man hiding in a corner with a camera... watching. -Alfred Hitchcock Based on the book Alfred Hitchcock and the Making of Psycho by Stephen Rebello that details every aspect imaginable of th..."
        },
        {
          "text": "Casting Anthony Hopkins as the Master of Suspense was absolutely genius."
        },
        {
          "text": "my main takeaway here is that this man could EAT… 3 cans of foie gras in a row? in the middle of the night? no bread no crackers just raw dogging it with a spoon? god damn"
        }
      ],
      "userRating": 2,
      "ratingDiff": -1.1,
      "title": "Hitchcock",
      "year": 2012
    },
    "Johnny English (2003)": {
      "letterboxdRating": 3.07,
      "letterboxdSlug": "johnny-english",
      "topReviews": [
        {
          "text": "I eagerly await the day this masterpiece takes its rightful place among the criterion collection"
        },
        {
          "text": "“My God, what have they done to you?” “They’ve taken some of my blood” ”The bastards ”"
        },
        {
          "text": "fun fact: when I was about 12 I had a 3 meter high poster for Johnny English in my bedroom. Just a giant blown-up photo of Rowan Atkinson with a gun watching me sleep. I have no idea why"
        },
        {
          "text": "hands down has the best theme song ever written for a film"
        },
        {
          "text": "My favorite Bond movie, i think"
        }
      ],
      "userRating": 2,
      "ratingDiff": -1.0699999999999998,
      "title": "Johnny English",
      "year": 2003
    },
    "Shiva Baby (2020)": {
      "letterboxdRating": null,
      "error": "curl failed: spawnSync /bin/sh ETIMEDOUT",
      "title": "Shiva Baby",
      "year": 2020,
      "userRating": 2
    },
    "Anyone But You (2023)": {
      "letterboxdRating": 2.84,
      "letterboxdSlug": "anyone-but-you",
      "topReviews": [],
      "userRating": 2,
      "ratingDiff": -0.8399999999999999,
      "title": "Anyone But You",
      "year": 2023
    },
    "Get Away (2024)": {
      "letterboxdRating": 2.5,
      "letterboxdSlug": "get-away-2",
      "topReviews": [
        {
          "text": "could be quite thrilling if you’ve never seen a movie before"
        },
        {
          "text": "That blood soaked third act was great but that random plot twist ?? all that buildup for that twist? Too over the top for me."
        },
        {
          "text": "families who slay together stay together"
        },
        {
          "text": "Shudder presents We're the Millers"
        },
        {
          "text": "I’m struggling with giving this even one star, it was just trying too hard to be funny & I couldn’t wait for it to be over… but, I felt I had to watch it till the end in case it got good. Some of the ..."
        }
      ],
      "userRating": 2,
      "ratingDiff": -0.5,
      "title": "Get Away",
      "year": 2024
    },
    "Lessons of Darkness (1992)": {
      "letterboxdRating": null,
      "error": "curl failed: spawnSync /bin/sh ETIMEDOUT",
      "title": "Lessons of Darkness",
      "year": 1992,
      "userRating": 2
    },
    "A Charlie Brown Thanksgiving (1973)": {
      "letterboxdRating": 3.91,
      "letterboxdSlug": "a-charlie-brown-thanksgiving",
      "topReviews": [
        {
          "text": "I fucking love watching Snoopy get bodied by that folding chair every Thanksgiving"
        },
        {
          "text": "snoopy brought a loaded gun into charlie brown's home"
        },
        {
          "text": "if someone came to my thanksgiving dinner and screamed about the food my DOG made i would lose it"
        },
        {
          "text": "patty you ungrateful wench, eat ur popcorn and toast and shut up!!"
        },
        {
          "text": "there are so many lines in this that go so hard, like “you’ll just pull that football away and I’ll KILL MYSELF”"
        }
      ],
      "userRating": 2,
      "ratingDiff": -1.9100000000000001,
      "title": "A Charlie Brown Thanksgiving",
      "year": 1973
    },
    "TRON: Legacy (2010)": {
      "letterboxdRating": 3.26,
      "letterboxdSlug": "tron-legacy",
      "topReviews": [
        {
          "text": "Surely one of the best-looking, best-sounding bad movies ever made."
        },
        {
          "text": "I can't believe Disney spent 170 million $ on a Daft Punk video."
        },
        {
          "text": "Bio-digital jazz, man"
        },
        {
          "text": "ps3 jeff bridges"
        },
        {
          "text": "yeah ngl i miss that phase in the early 2010s when disney made ambitious and totally earnest shit like this as opposed to whatever the fuck is going on rn. this is a kids movie, but it’s crafted speci..."
        }
      ],
      "userRating": 2,
      "ratingDiff": -1.2599999999999998,
      "title": "TRON: Legacy",
      "year": 2010
    },
    "A Suite Holiday Romance (2025)": {
      "letterboxdRating": null,
      "letterboxdSlug": "a-suite-holiday-romance",
      "error": "no_rating",
      "title": "A Suite Holiday Romance",
      "year": 2025,
      "userRating": 2
    },
    "Christmas Above the Clouds (2025)": {
      "letterboxdRating": 2.92,
      "letterboxdSlug": "christmas-above-the-clouds",
      "topReviews": [
        {
          "text": "HER NAME IS ELLA NEEZER🤣🤣🤣🤣. These writers are smoking something good 😆 This goes so hard on the Christmas Carol references that it’s absurd🕰️. The height of camp🎁 But I just eat it up. Christm..."
        },
        {
          "text": "I guess they thought we wouldn’t understand that this ill little boy named Tim was the Tiny Tim unless he was wearing that freak hat."
        },
        {
          "text": "Ella got clocked left & right during the Ghost of Christmas Present segment, and we love to see it. 👏🏽 — 2025 Hallmark Ranked — Hallmark Christmas: Ranked"
        },
        {
          "text": "STOP 👏 MAKING 👏 BEING 👏 A 👏 LIBRARIAN 👏 SOMEONE’S 👏 WORST 👏 FATE 👏 - sincerely, a librarian also the thought of gefilte fish on a 20 hour flight would make me change my ways, no ghosts needed"
        },
        {
          "text": "The kid having asthma as his illness was definitely a choice."
        }
      ],
      "userRating": 2,
      "ratingDiff": -0.9199999999999999,
      "title": "Christmas Above the Clouds",
      "year": 2025
    },
    "Everything Christmas (2023)": {
      "letterboxdRating": 2.65,
      "letterboxdSlug": "everything-christmas",
      "topReviews": [
        {
          "text": "These movies where Santa stalks women🎅🏻 and magically interferes in their love life💖 are both horrifying & hilarious. The weirdo Xmas-addicted lead🫨 seemed like she could snap at any moment so I o..."
        },
        {
          "text": "A chilling horror film in which two women are stalked across the country by a large bearded man."
        },
        {
          "text": "“what if i told you none of it was accidental and the first time that you saw me nothing was gonna stop me i laid the groundwork and then just like clockwork the dominoes cascaded in a line what if i ..."
        },
        {
          "text": "love how she just wanted everyone to leave their job and follow her"
        },
        {
          "text": "the way zack opened the fortune cookie convinced me he could be a serial killer"
        }
      ],
      "userRating": 2,
      "ratingDiff": -0.6499999999999999,
      "title": "Everything Christmas",
      "year": 2023
    },
    "Grease (1978)": {
      "letterboxdRating": 3.54,
      "letterboxdSlug": "grease",
      "topReviews": [
        {
          "text": "danny lowkey gay asf"
        },
        {
          "text": "the feminism leaving my body as Sandy changes everything about herself to be with a dude but looks really hot in a leather catsuit so it’s fine"
        },
        {
          "text": "i can buy the car flying away but sandy becoming a pick-me girl i will never understand"
        },
        {
          "text": "actively ignoring that half the cast looks 40 years old"
        },
        {
          "text": "tell me about it... 𝓼𝓽𝓾𝓭"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.46,
      "title": "Grease",
      "year": 1978
    },
    "La La Land (2016)": {
      "letterboxdRating": 4.12,
      "letterboxdSlug": "la-la-land",
      "topReviews": [
        {
          "text": "this cured my depression and brought it back full force in the span of 2 hours"
        },
        {
          "text": "Love this movie more than I love myself"
        },
        {
          "text": "I've taken all of your criticisms into account and have determined that you're all wrong."
        },
        {
          "text": "la la land makes me want to be alive for one hour and fifty minutes then sebastian says welcome to seb's and it makes me want to be dead"
        },
        {
          "text": "“No Jamal...you be trippin.”"
        }
      ],
      "userRating": 5,
      "ratingDiff": 0.8799999999999999,
      "title": "La La Land",
      "year": 2016
    },
    "Superbad (2007)": {
      "letterboxdRating": 3.89,
      "letterboxdSlug": "superbad",
      "topReviews": [
        {
          "text": "wish i could say i never had a crush on michael cera"
        },
        {
          "text": "i swear, emma stone has the best \"what the fuck\" in film history."
        },
        {
          "text": "your cock is so smooth. thanks, your's would be too if you were a man."
        },
        {
          "text": "I WAS GONNA GO DOWN ON HER, FOR LIKE, SEVERAL HOURS"
        },
        {
          "text": "The funny thing about my back is that it’s located on my cock"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.1099999999999999,
      "title": "Superbad",
      "year": 2007
    },
    "Ferris Bueller's Day Off (1986)": {
      "letterboxdRating": 3.95,
      "letterboxdSlug": "ferris-buellers-day-off",
      "topReviews": [
        {
          "text": "In a selfish attempt to cope with his separation anxiety, a sociopathic student abuses his relationship with his mentally unstable best friend in order to throw his future away on a single day of rauc..."
        },
        {
          "text": "i got lost today in the art institute trying to find the painting that cameron had an existential crisis in front of but it was fucking worth it"
        },
        {
          "text": "\"Oh, he's very popular Ed. The sportos, the motorheads, geeks, sluts, bloods, wastoids, dweebies, dickheads - they all adore him. They think he's a righteous dude.\""
        },
        {
          "text": "when i was a kid i always thought cameron had a crush on ferris and you know what? i was right"
        },
        {
          "text": "ferris bueller is my manic pixie dream boy"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.0499999999999998,
      "title": "Ferris Bueller's Day Off",
      "year": 1986
    },
    "One Week (1920)": {
      "letterboxdRating": 4.19,
      "letterboxdSlug": "one-week",
      "topReviews": [
        {
          "text": "oh to live in buster keaton’s world of trampoline spring floors, and effortlessly carrying pianos on your shoulders, and porch railings that turn into ladders, and paint-by-number houses that spin on ..."
        },
        {
          "text": "My pick for Keaton's best short by a mile. A perfect merging of his death-defying physicality with the most literal construction of gag setpieces he could've possibly come up: domestic romcom action m..."
        },
        {
          "text": "From a technical standpoint, One Week is one of the most impressive short films I've ever seen. The stunts are absolutely incredible from the very beginning, and they only get bigger and better by the..."
        },
        {
          "text": "One inventive gag after another."
        },
        {
          "text": "i don't have any idea how keaton had that house spin around in the storm, that shit is straight-up movie magick to me, how the hell?"
        }
      ],
      "userRating": 5,
      "ratingDiff": 0.8099999999999996,
      "title": "One Week",
      "year": 1920
    },
    "Big (1988)": {
      "letterboxdRating": 3.59,
      "letterboxdSlug": "big",
      "topReviews": [
        {
          "text": "If you skip the first 20 minutes of the movie, it's just the story of an autistic man overcoming his hardships in the workplace."
        },
        {
          "text": "This falls under the category of \"fun 80s movies that become INSANELY uncomfortable if you think about it for too long\""
        },
        {
          "text": "It's weird that he and Elizabeth Perkins have sex."
        },
        {
          "text": "imagine this movie from the mom’s perspective."
        },
        {
          "text": "watching this movie for the first time in 2018 is BONKERS. i really dug it but soooo much of the comedy is actually horrifying and so much of the sentimentality is actually hilarious. what a trip. the..."
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.4100000000000001,
      "title": "Big",
      "year": 1988
    },
    "Fire of Love (2022)": {
      "letterboxdRating": 4.14,
      "letterboxdSlug": "fire-of-love-2022",
      "topReviews": [
        {
          "text": "Heterosexuality is a woman being like \"I am risking my life to study the minutiae of volcanos\" and her husband being like \"my goal is to row a canoe down a river of lava!\""
        },
        {
          "text": "when tilda swinton and john c reilly reunite for this biopic and both earn oscars for kissing near erupting volcanoes"
        },
        {
          "text": "“I follow him, because if he’s going to die I’d rather be with him.”"
        },
        {
          "text": "miranda july always sounds like she’s seconds away from crying really hard"
        },
        {
          "text": "the earth is beautiful and terrifying and so is love"
        }
      ],
      "userRating": 5,
      "ratingDiff": 0.8600000000000003,
      "title": "Fire of Love",
      "year": 2022
    },
    "Ocean's Eleven (2001)": {
      "letterboxdRating": 3.93,
      "letterboxdSlug": "oceans-eleven-2001",
      "topReviews": [
        {
          "text": "here's a list of food that Rusty Ryan eats in The Best Male Fantasy of All Time ™ aka Ocean's Eleven ( 2001 ) . please let me know if i missed anything—it was very hard to keep track. -nachos -salad x..."
        },
        {
          "text": "\"You suicidal?\" \"Only in the morning.\""
        },
        {
          "text": "George Clooney and Brad Pitt make such hot and heavy eye contact when they reunite I almost left the room to give them space."
        },
        {
          "text": "Hosted a screening of this tonight as a movie that I believe everybody should watch. I think it’s truly a near-perfect film. Terrific at show-don’t-tell, extremely well-written, laced with brilliant b..."
        },
        {
          "text": "The coolest movie ever made"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.0699999999999998,
      "title": "Ocean's Eleven",
      "year": 2001
    },
    "Monsters, Inc. (2001)": {
      "letterboxdRating": 4.08,
      "letterboxdSlug": "monsters-inc",
      "topReviews": [
        {
          "text": "door city over here"
        },
        {
          "text": "mike: i remember the first time i laid eye on you me everytime i watch: wow that was a good line, clever"
        },
        {
          "text": "the monsters inc warehouse closet door chase scene &gt; the inception hotel corridor fight scene"
        },
        {
          "text": "Too unrealistic. There's no way a CEO would be so swiftly arrested for corruption. It's a complete fantasy."
        },
        {
          "text": "i love my two dads: james p. sullivan and mike wazowski"
        }
      ],
      "userRating": 5,
      "ratingDiff": 0.9199999999999999,
      "title": "Monsters, Inc.",
      "year": 2001
    },
    "Freedom Writers (2007)": {
      "letterboxdRating": 3.72,
      "letterboxdSlug": "freedom-writers",
      "topReviews": [
        {
          "text": "Me: Lazy teacher: *plays this movie*"
        },
        {
          "text": "This white savior shit wasn't supposed to make me cry but IT DID"
        },
        {
          "text": "Why was her husband such an ass???? He was insecure because he wasn’t doing anything and tried to shame her for her success... smh"
        },
        {
          "text": "Of course Umbridge would be the one trying to stop Ms. G."
        },
        {
          "text": "A character in this looks EXACTLY like Tyler, The Creator and I can’t get over it."
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.2799999999999998,
      "title": "Freedom Writers",
      "year": 2007
    },
    "The Double (2013)": {
      "letterboxdRating": 3.58,
      "letterboxdSlug": "the-double-2013",
      "topReviews": [
        {
          "text": "i feel like jesse eisenberg did this movie because he was jealous that armie hammer got cloned in the social network (2010) and he didn’t"
        },
        {
          "text": "this whole movie feels like when you tell a joke and no one hears it but then someone repeats it louder and everyone laughs"
        },
        {
          "text": "\"I like to think I'm pretty unique.\" I have a theory. You know what that means? It's time for Silly Psychoanalysis with Screening Notes! Everybody get your Silly Theory Hats on! I'm going to be analyz..."
        },
        {
          "text": "take Dostoyevsky, add 1 part Gilliam, 1 part Tati & a thimble of early Woody Allen. stir to near-perfection. i wasn't impressed by the instantly forgettable SUBMARINE, but Ayoade wows here, bending th..."
        },
        {
          "text": "The Double is an Orwellian nightmare, doused in sickly artificial light and imbued with delightfully awkward absurdism. Ayoade has crafted a film that feels like a scrapbook of his influences all blen..."
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.42,
      "title": "The Double",
      "year": 2013
    },
    "The Ballad of Wallis Island (2025)": {
      "letterboxdRating": 3.89,
      "letterboxdSlug": "the-ballad-of-wallis-island",
      "topReviews": [
        {
          "text": "Dame Judi Drenched in tears"
        },
        {
          "text": "This is a really nice movie that made me feel happy. Sometimes that is enough!"
        },
        {
          "text": "“To paraphrase the Beatles, ‘there goes the sun’”"
        },
        {
          "text": "if i ever won the lottery i wouldnt tell anyone but there would be signs"
        },
        {
          "text": "the band geek of inisherin"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.1099999999999999,
      "title": "The Ballad of Wallis Island",
      "year": 2025
    },
    "tick, tick... BOOM! (2021)": {
      "letterboxdRating": 3.84,
      "letterboxdSlug": "tick-tick-boom-2021",
      "topReviews": [
        {
          "text": "You see how much good Lin-Manuel Miranda can do when he's not in front of the camera?"
        },
        {
          "text": "congrats to tick, tick… boom! for being a james corden-free musical"
        },
        {
          "text": "Andrew Garfield's performance in this is a historic landmark for theater kid cinema."
        },
        {
          "text": "RIP Jonathan Larson, you would have loved the Notes app"
        },
        {
          "text": "Jonathan Larson: “Aw man, I can’t figure out my next musical. :(” Landlord: “Ayyy, Johnny, do you have my… rent ?” Cut to black"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.1600000000000001,
      "title": "tick, tick... BOOM!",
      "year": 2021
    },
    "Arrival (2016)": {
      "letterboxdRating": 4.13,
      "letterboxdSlug": "arrival-2016",
      "topReviews": [
        {
          "text": "memory is a strange thing. for example, i remember amy adams's performance as being one of the best of 2016, but the academy seemed to remember differently"
        },
        {
          "text": "SHE FORGOT HOW GOOD IT FELT TO BE HELD BY HIM"
        },
        {
          "text": "Okay, so now that i've sat down and thought about this, i'm ready to talk. This movie is 100% a masterpiece. The visuals are perfect, the acting, ESPECIALLY from Amy Adams, is wonderful. The fucking s..."
        },
        {
          "text": "still waiting for a heptapod duolingo update ...... need that lil green owl to teach me their language i wanna be besties with those intellectual space octopuses !!!!"
        },
        {
          "text": "If I was an alien I would too only trust Amy Adams"
        }
      ],
      "userRating": 5,
      "ratingDiff": 0.8700000000000001,
      "title": "Arrival",
      "year": 2016
    },
    "Scott Pilgrim vs. the World (2010)": {
      "letterboxdRating": 3.88,
      "letterboxdSlug": "scott-pilgrim-vs-the-world",
      "topReviews": [
        {
          "text": "me during every scene that doesn't have wallace in it: hmmmm... needs more wallace"
        },
        {
          "text": "I relate to Scott Pilgrim because I'm 1. actually the worst 2. not good with relationships 3. a total asshole 4. afraid of confrontation 5. not worthy of the people in my life 6. cute kinda ugly 7. su..."
        },
        {
          "text": "YOU ONCE WERE A VE-GON BUT NOW YOU WILL BE-GONE"
        },
        {
          "text": "I'm in lesbians with this movie."
        },
        {
          "text": "MULTIPLE girls finding michael cera attractive???? sounds super fake but ok"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.12,
      "title": "Scott Pilgrim vs. the World",
      "year": 2010
    },
    "Rushmore (1998)": {
      "letterboxdRating": 3.89,
      "letterboxdSlug": "rushmore",
      "topReviews": [
        {
          "text": "‘these are O.R. scrubs.’ ‘O R they?’ I CHOKED"
        },
        {
          "text": "max fischer saved latin at 15, wtf you doin' with yo life?"
        },
        {
          "text": "One of the best movies about a sociopath."
        },
        {
          "text": "Max is exactly what happens if you give theatre kids too much of a platform"
        },
        {
          "text": "Dirk Calloway is really the only one here with a decent head on his shoulders."
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.1099999999999999,
      "title": "Rushmore",
      "year": 1998
    },
    "Bridge of Spies (2015)": {
      "letterboxdRating": 3.6,
      "letterboxdSlug": "bridge-of-spies",
      "topReviews": [
        {
          "text": "i will never forgive Spielberg for not calling this movie SALMON FISHING IN BERLIN. but it's very good. if there's any movie at NYFF that *should* have been written by Aaron Sorkin... not that the Coe..."
        },
        {
          "text": "do you think they set out to make this dull as fuck or was it an accident"
        },
        {
          "text": "Think it was Dargis who pointed out this great quote from John Le Carré: \"for how long can we defend ourselves by methods of this kind, and still remain the kind of society that is worth defending?\" a..."
        },
        {
          "text": "huge representation for the “a little sick and wants to go home” community"
        },
        {
          "text": "the movie truly did deliver on its title. there really was a bridge of spies 😌"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.4,
      "title": "Bridge of Spies",
      "year": 2015
    },
    "Youth in Revolt (2009)": {
      "letterboxdRating": 3.1,
      "letterboxdSlug": "youth-in-revolt",
      "topReviews": [
        {
          "text": "Michael Cera is Michael Cera in a Michael Cera film where Michael Cera plays Michael Cera in a Michael Cera film. Micheal Cera has his Michael Cera moments though. 3 Michael Ceras out of 5 Michael Cer..."
        },
        {
          "text": "this is what zero pussy does to a mf"
        },
        {
          "text": "i have two personalities nicest guy you'll ever meet and twisted fucking psychopath"
        },
        {
          "text": "if fight club was good"
        },
        {
          "text": "Me: what a shit film Also Me: 4 stars, add to faves list"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.9,
      "title": "Youth in Revolt",
      "year": 2009
    },
    "The Incredibles (2004)": {
      "letterboxdRating": 4.07,
      "letterboxdSlug": "the-incredibles",
      "topReviews": [
        {
          "text": "An absolutely flawless, mature family drama. It genuinely feels like it was written for adults first and kids were kind of an afterthought. Animation as a medium rarely gets better than this."
        },
        {
          "text": "14 years later i'm still the kid on the tricycle"
        },
        {
          "text": "We really didn't need another superhero movie after this. A few notes on this revisit: - Pulls no punches on the domestic trauma front. This is about a husband and father's real betrayal. That late-ni..."
        },
        {
          "text": "My favorite children's movie that features torture, a suicide attempt, a corpse and general mass destruction."
        },
        {
          "text": "movies need new parental guidelines. I don’t give a shit how much violence or whatever there is in The Incredibles, I needed someone to warn me that I was almost *immediately* going to have to try to ..."
        }
      ],
      "userRating": 5,
      "ratingDiff": 0.9299999999999997,
      "title": "The Incredibles",
      "year": 2004
    },
    "Kindergarten Cop (1990)": {
      "letterboxdRating": 3.16,
      "letterboxdSlug": "kindergarten-cop",
      "topReviews": [
        {
          "text": "70 A rare action-comedy that is more comedy than action. Most of this is just Arnold Schwarzenegger hanging out with small children and it's adorable. What a concept."
        },
        {
          "text": "\"Are these all your lunches? You mean you eat other people's lunches? STOP IT!\" I just love Arny. No matter what he does, you just gotta love the guy. He always puts a smile on my face."
        },
        {
          "text": "Probably no one on Earth needs more writing from me about Schwarzenegger, so instead a word of praise for the key supporting player in the movie: Pamela Reed as Schwarzenegger’s partner, Phoebe O’Hara..."
        },
        {
          "text": "an Arnold quote generator on par with BATMAN & ROBIN and a surprisingly violent and unpleasant family comedy. the end of this movie will fuck up that poor little boy for the rest of his life, it's pre..."
        },
        {
          "text": "Here’s how Arnold ushered in the 90s: Total Recall Kindergarten Cop T2: Judgement Day A fascinating run for a man who was pinned as the meathead of the 80s. Not a slight on his 80s filmography, which ..."
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.8399999999999999,
      "title": "Kindergarten Cop",
      "year": 1990
    },
    "Little Miss Sunshine (2006)": {
      "letterboxdRating": 4.2,
      "letterboxdSlug": "little-miss-sunshine",
      "topReviews": [
        {
          "text": "dwayne's first word in nine months being \"fuck\" is very relatable"
        },
        {
          "text": "I can't believe this movie simultaneously caused and cured my depression!"
        },
        {
          "text": "Michael Scott, Walter White, ASAC Hank Schrader, the pastor from There Will Be Blood, and the mom from Hereditary walk into a beauty pageant"
        },
        {
          "text": "when your circle small but yall crazy"
        },
        {
          "text": "Everyone is entitled to their own opinion but if you don’t like this movie you’re absolutely wrong"
        }
      ],
      "userRating": 5,
      "ratingDiff": 0.7999999999999998,
      "title": "Little Miss Sunshine",
      "year": 2006
    },
    "Happyend (2024)": {
      "letterboxdRating": 3.96,
      "letterboxdSlug": "happyend",
      "topReviews": [
        {
          "text": "not to be dramatic or anything but i think i might have just watched my new favourite film of all time"
        },
        {
          "text": "Teenage wasteland in the prologue to the end of the world. The door to a dystopian future has been knocked clean; they are living it. Democracy exists in name alone as uncomfortable levels of surveill..."
        },
        {
          "text": "put me and that woke teacher in a room together and i’ll show you a real happyend"
        },
        {
          "text": "so there’s this really beautiful movie …. that i saw earlier today …. and i loved everything about it so much that i don’t even really want to put it into words i just want to cherish it….and well? th..."
        },
        {
          "text": "When does the boilerroom set of the DJ drop?"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.04,
      "title": "Happyend",
      "year": 2024
    },
    "Inside Man (2006)": {
      "letterboxdRating": 3.69,
      "letterboxdSlug": "inside-man",
      "topReviews": [
        {
          "text": "I have this character, he’s the most normal cop in the world, that’s his thing he’s just really really normal. I think I’ll cast, hmm... Willem Dafoe."
        },
        {
          "text": "CHAIYYA CHAIYYA CHAIYYA CHAIYYA CHAL CHAIYYA CHAIYYA CHAIYYA CHAIYYA"
        },
        {
          "text": "Pretty much my favorite thing in cinema is to watch characters execute an immaculately-planned heist. So yes, I enjoyed this movie."
        },
        {
          "text": "A fun, sturdy little heist programmer with the most overqualified cast and crew you've ever seen. Spike could not be having more fun getting to do his own clever, tightly-plotted little magic trick ri..."
        },
        {
          "text": "I wish Spike would/could do more of this classic genre movie auteurist smuggling. What a blast."
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.31,
      "title": "Inside Man",
      "year": 2006
    },
    "I'm Still Here (2024)": {
      "letterboxdRating": 4.33,
      "letterboxdSlug": "im-still-here-2024",
      "topReviews": [
        {
          "text": "de todas as dores que existem, penso que a do não saber é a pior. não saber se vai voltar, não saber pra onde foi, não saber o que aconteceu e, por fim, não saber que aquela seria a última vez que o v..."
        },
        {
          "text": "what a fucking gut punch of a film. despite not knowing much about the military dictatorship in brazil ahead of time - if anything - i still immediately fell head over heels for this family and found ..."
        },
        {
          "text": "fernanda torres já fez tanto por você. prestigie no cinema a melhor atuação da vida dela. ela merece"
        },
        {
          "text": "DISCUSSAO MAIS ELABORADA NO VÍDEO: youtu.be/tutZaBgUDIs - Não dá pra negar o trabalho impecável de encenação aqui. é impressionante como parece que são duas casas completamente diferentes, uma antes e..."
        },
        {
          "text": "VIVA O CINEMA NACIONAL PORRAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAA"
        }
      ],
      "userRating": 5,
      "ratingDiff": 0.6699999999999999,
      "title": "I'm Still Here",
      "year": 2024
    },
    "Soulmate (2023)": {
      "letterboxdRating": 4.04,
      "letterboxdSlug": "soulmate-2023",
      "topReviews": [
        {
          "text": "why must this guy ruin everything"
        },
        {
          "text": "\"I realized that i don’t remember seeing your back because you were always beside me\""
        },
        {
          "text": "What if we're two girls, became best friends, raised a cat together, and love/hate each other while having this homoeroticism in the air that makes our relationship to be too romantic to be platonic."
        },
        {
          "text": "proof that men will always ruin everything"
        },
        {
          "text": "the space between 2 matching earrings, the space between notebook doodles and exhibition walls, the space between seoul and jeju island, the space between sunlight and shadow, the space between 27 and..."
        }
      ],
      "userRating": 5,
      "ratingDiff": 0.96,
      "title": "Soulmate",
      "year": 2023
    },
    "Dan in Real Life (2007)": {
      "letterboxdRating": 3.31,
      "letterboxdSlug": "dan-in-real-life",
      "topReviews": [
        {
          "text": "sad steve carell characters are very personal to me"
        },
        {
          "text": "Big family sharing a cozy vacation house in Rhode Island, wearing sweaters? Perfect movie"
        },
        {
          "text": "matthew morrison jumpscare"
        },
        {
          "text": "In what world would a woman like Juliette Binoche date a man like Dane Cook"
        },
        {
          "text": "why is steve carell so sad all the time someone please give him a hug"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.69,
      "title": "Dan in Real Life",
      "year": 2007
    },
    "Swing Girls (2004)": {
      "letterboxdRating": 4.35,
      "letterboxdSlug": "swing-girls",
      "topReviews": [
        {
          "text": "Puberty is when teenage boys and girls start thinking about nothing but sax all the time."
        },
        {
          "text": "There are 2 kinds of movies in this world. Movies that swing and movies that don't."
        },
        {
          "text": "Meeting jazz. Food poisoning the brass band. Accidentally killing a boar and getting rewarded for it. Selling a Playstation console for instruments. Everyone in the cast whose character plays their re..."
        },
        {
          "text": "Contains the actual best use of What A Wonderful World"
        },
        {
          "text": "I don’t think I have ever felt so much happiness watching a film before in my whole life and I never will again lol"
        }
      ],
      "userRating": 5,
      "ratingDiff": 0.6500000000000004,
      "title": "Swing Girls",
      "year": 2004
    },
    "Sing Street (2016)": {
      "letterboxdRating": 4.04,
      "letterboxdSlug": "sing-street",
      "topReviews": [
        {
          "text": "Y'all really put two la la Land songs up for best original song....as if 'Drive it Like You Stole it' wasn't literally sitting right fucking there bitch,...."
        },
        {
          "text": "today's mood is wearing ugly sweaters and wire rimmed glasses while holding a rabbit and being repressed by catholicism"
        },
        {
          "text": "they wrote a character that plays every instrument & is obsessed with rabbits and expected me not to fall in love...... interesting"
        },
        {
          "text": "“no woman can ever love a man who listens to Phil Collins” mum turns to me: your dad loved phil collins my parents are divorced so its true people"
        },
        {
          "text": "Everyone is going to get so sick of me talking about this movie."
        }
      ],
      "userRating": 5,
      "ratingDiff": 0.96,
      "title": "Sing Street",
      "year": 2016
    },
    "The Bourne Identity (2002)": {
      "letterboxdRating": 3.74,
      "letterboxdSlug": "the-bourne-identity-2002",
      "topReviews": [
        {
          "text": "matt damon looks like that kid from middle school who stapled his own hand for no reason"
        },
        {
          "text": "guess you could say that having amnesia is like being bourne again"
        },
        {
          "text": "if Matt Damon got into my car and asked me to drive to France he wouldn't even have to pay me"
        },
        {
          "text": "77/100 The Dolphin sound effect near the end is C I N E M A."
        },
        {
          "text": "i really enjoyed it but one day im going to make a list of action/crime films ranked by how unnecessary and painfully forced the heterosexual romances were"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.2599999999999998,
      "title": "The Bourne Identity",
      "year": 2002
    },
    "A Few Good Men (1992)": {
      "letterboxdRating": 4.03,
      "letterboxdSlug": "a-few-good-men",
      "topReviews": [
        {
          "text": "Everyone quotes \"You can't handle the truth!\" but a minute later Jack Nicholson screams, \"I'm gonna rip the eyes out of your head and piss into your dead skull!\" and it's just as good"
        },
        {
          "text": "i blast sorkin dialogue over my living room speakers at dinner parties to show my fancy guests that i too enjoy classical music"
        },
        {
          "text": "kevin bacon can court martial me anytime"
        },
        {
          "text": "Jack Nicholson looks like he eats babies"
        },
        {
          "text": "Did I enjoy this film? YOU’RE GODDAMN RIGHT, I DID"
        }
      ],
      "userRating": 5,
      "ratingDiff": 0.9699999999999998,
      "title": "A Few Good Men",
      "year": 1992
    },
    "Jack Reacher (2012)": {
      "letterboxdRating": 3.2,
      "letterboxdSlug": "jack-reacher",
      "topReviews": [
        {
          "text": "i liked this movie because it was 2 hours of tom cruise mind-fucking people. a typical scene: Jack Reacher: \"does shelly work here?\" Random Vaguely Evil N00B: \"she's not in today.\" Jack Reacher: \"than..."
        },
        {
          "text": "Tom Cruise nearly beats a man to death with another man's head."
        },
        {
          "text": "Remembered this being just “pretty good” but clearly I was an idiot ten years ago. This is so fucking great. If it came out now I would be throwing a parade in its honor. Maybe I should give it an ext..."
        },
        {
          "text": "pretty sure i rented this in 1996."
        },
        {
          "text": "In order to buy a construction company in Pittsburgh, you gotta dome a bunch of people with a sniper rifle to cover up overcharging the city a few thousand dollars for another bridge. Pittsburgh just ..."
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.7999999999999998,
      "title": "Jack Reacher",
      "year": 2012
    },
    "Game Night (2018)": {
      "letterboxdRating": 3.51,
      "letterboxdSlug": "game-night",
      "topReviews": [
        {
          "text": "the delivery of “OH NO HE DIED”... maybe rachel’s oscar nomination got lost in the mail"
        },
        {
          "text": "Holy shit. This is... maybe the best mainstream comedy movie I have seen in a very long time. Every single aspect of it was done well! Direction, script, even the way it’s shot. Every actor is hilario..."
        },
        {
          "text": "well, when life gives you plemons"
        },
        {
          "text": "my girlfriend asked which one of southwest’s in-flight film selections would best distract her from her fear of flying and i evangelized about how good Game Night was. then i watched it over her shoul..."
        },
        {
          "text": "Things missing from Game Night : Tired, overdone high-on-drugs sequence; someone’s bare ass we didn’t ask to see; James Franco; a barrage of penis, boobs and vagina jokes; a diarrhea scene ( classic c..."
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.4900000000000002,
      "title": "Game Night",
      "year": 2018
    },
    "Burden of Dreams (1982)": {
      "letterboxdRating": 4.09,
      "letterboxdSlug": "burden-of-dreams",
      "topReviews": [
        {
          "text": "\"If I abandon this project I would be a man without dreams, and I don't want to live like that.\" Someone really missed out on a great opportunity to call this Herzcarraldo . It's amazing how closely t..."
        },
        {
          "text": "\"I'm tired of it all and I couldn't care less if they move the stupid ship – or finish the fucking film.\" - Les Blank's personal production journal from Burden of Dreams . Les Blank is not a megaloman..."
        },
        {
          "text": "Feeling a bit melancholy that auteur megalomania of this scale has gone so out of fashion in recent years. Like him or not, Iñárritu is the only guy keeping it alive."
        },
        {
          "text": "This film answers two important questions: why you should be a filmmaker and why you shouldn’t be a filmmaker. 8.2 / 10"
        },
        {
          "text": "Got to see the new 4K restoration in theaters, which was pretty fun. An odd sort of film to watch with a group, it's equal parts shocking, disturbing, and at times pretty absurdly funny. \"This guy's n..."
        }
      ],
      "userRating": 5,
      "ratingDiff": 0.9100000000000001,
      "title": "Burden of Dreams",
      "year": 1982
    },
    "Cheaper by the Dozen (2003)": {
      "letterboxdRating": 3.15,
      "letterboxdSlug": "cheaper-by-the-dozen-2003",
      "topReviews": [
        {
          "text": "\" i heard you were dissing my family \" \"i don't even know your family LOSER \" \"you do now 👊\" \"my latte! \""
        },
        {
          "text": "it's pretty amazing how this film can make me want no kids and 12 kids all at the same time"
        },
        {
          "text": "this is so good but also i can't believe they tried to convince us even for a moment that tom welling would have been bullied by jared padalecki"
        },
        {
          "text": "ʏᴏᴜ SOAKED ʜɪs UNDERWEAR ɪɴ MEAT... THAT ɪs sᴏ WRONG ... FUNNY ! BUT ᴡʀᴏɴɢ ..."
        },
        {
          "text": "tom welling im free on thursdays if you want to hang out"
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.85,
      "title": "Cheaper by the Dozen",
      "year": 2003
    },
    "Beyond the Infinite Two Minutes (2020)": {
      "letterboxdRating": 3.91,
      "letterboxdSlug": "beyond-the-infinite-two-minutes",
      "topReviews": [
        {
          "text": "Christopher Nolan might be embarassed seeing how cheap and fun cinema can actually be!"
        },
        {
          "text": "Tenet minus about $199,500,000, minus western actors, minus IMAX cameras (or Arri cameras, for that matter), plus more fun, plus lots of passion for cinema, and plus the makings of being the next \"One..."
        },
        {
          "text": "You don’t need a lot to make a mind-bending single-shot sci-fi movie. Apparently, all you need is a GoPro, a great idea, and a lot of commitment."
        },
        {
          "text": "It's up to you whether you go or not. You'll go, though! This is a message from 70 minutes in the future. Click on the link below right now, and watch this overlooked gem on Tubi for FREE. It's FREE! ..."
        },
        {
          "text": "OMG!!! This is the most incredible little movie I have ever seen!!! I'm so happy I watched it, I can't even describe how much I enjoyed it, seriously. Confusing, but very well organized, the film resp..."
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.0899999999999999,
      "title": "Beyond the Infinite Two Minutes",
      "year": 2020
    },
    "Hotel Rwanda (2004)": {
      "letterboxdRating": 3.85,
      "letterboxdSlug": "hotel-rwanda",
      "topReviews": [
        {
          "text": "\"NOT a date movie\" - Dean Pelton (Community)"
        },
        {
          "text": "Hotel Rwanda might have a great score on Rotten Tomatoes but Yelp reviews are terrible."
        },
        {
          "text": "The sentimental influence of Hollywood blunts the sharp blade of an African holocaust. Hotel Rwanda (2004) concerns the Rwandan genocide that had occurred a decade previous – a mass slaughter of Tutsi..."
        },
        {
          "text": "One of the more unfortunate cases of taking the Schindler's List Approach to recount a genocide. This \"one man braving all odds to save the day\" angle is particularly praised by Hollywood, since it fe..."
        },
        {
          "text": "Paul Rusesabagina: “I am glad that you have shot this footage and that the world will see it. It is the only way we have a chance that people might intervene..“ Jack: “Yeah and if no one intervenes, i..."
        }
      ],
      "userRating": 5,
      "ratingDiff": 1.15,
      "title": "Hotel Rwanda",
      "year": 2004
    },
    "Dune: Part Two (2024)": {
      "letterboxdRating": 4.38,
      "letterboxdSlug": "dune-part-two",
      "topReviews": [
        {
          "text": "damn it sucks when your boyfriend gets really high and thinks he’s jesus"
        },
        {
          "text": "my favorite part of the film is when timothée and austin butler have a literal knife fight over who gets to be the next white boy of the month"
        },
        {
          "text": "Need a friend like Stilgar to hype me up all the time"
        },
        {
          "text": "austin butler is so bald. i've never seen anyone be so bald in my life. so moisturised and bald. he was glowing more than edward in twilight. what's your megamind head skin care routine, elvis boy"
        },
        {
          "text": "one of those moviegoing experiences i’ll cherish for the rest of my life"
        }
      ],
      "userRating": 5,
      "ratingDiff": 0.6200000000000001,
      "title": "Dune: Part Two",
      "year": 2024
    },
    "Carry-On (2024)": {
      "letterboxdRating": 3,
      "letterboxdSlug": "carry-on-2024",
      "topReviews": [
        {
          "text": "Paul Blart wouldn’t have let it get that far"
        },
        {
          "text": "It’s been a tough year and I think we’ve all earned a little fun copaganda. As a treat."
        },
        {
          "text": "A little too many Jason Bateman voiceovers, I kept thinking the fox from Zootopia turned evil"
        },
        {
          "text": "if jason bateman was in my ear giving me orders this would’ve been a much different movie"
        },
        {
          "text": "christmas and terrorism just go hand-in-hand."
        }
      ],
      "userRating": 3,
      "ratingDiff": 0,
      "title": "Carry-On",
      "year": 2024
    },
    "The Peanuts Movie (2015)": {
      "letterboxdRating": null,
      "error": "curl failed: spawnSync /bin/sh ETIMEDOUT",
      "title": "The Peanuts Movie",
      "year": 2015,
      "userRating": 4
    },
    "13 Going on 30 (2004)": {
      "letterboxdRating": null,
      "error": "curl failed: spawnSync /bin/sh ETIMEDOUT",
      "title": "13 Going on 30",
      "year": 2004,
      "userRating": 3
    },
    "Eternal Sunshine of the Spotless Mind (2004)": {
      "letterboxdRating": null,
      "error": "curl failed: spawnSync /bin/sh ETIMEDOUT",
      "title": "Eternal Sunshine of the Spotless Mind",
      "year": 2004,
      "userRating": 3
    },
    "The Order (2024)": {
      "letterboxdRating": null,
      "error": "curl failed: spawnSync /bin/sh ETIMEDOUT",
      "title": "The Order",
      "year": 2024,
      "userRating": 3
    },
    "My Old Ass (2024)": {
      "letterboxdRating": 3.53,
      "letterboxdSlug": "my-old-ass",
      "topReviews": [
        {
          "text": "The Saoirse Ronan wall is too real."
        },
        {
          "text": "the next time i do shrooms i’m summoning aubrey plaza"
        },
        {
          "text": "Movies need to stop reminding me how fast time passes. Be young and dumb."
        },
        {
          "text": "yeah yeah bisexuality is valid and all that but if you make a movie about a girl who's so sure shes a lesbian and fucks women and talks about her dreams about her future wife until she meets the Perfe..."
        },
        {
          "text": "the biggest gift and the greatest curse is literally the passage of time"
        }
      ],
      "userRating": 3,
      "ratingDiff": -0.5299999999999998,
      "title": "My Old Ass",
      "year": 2024
    },
    "The Wild Robot (2024)": {
      "letterboxdRating": 4.21,
      "letterboxdSlug": "the-wild-robot",
      "topReviews": [
        {
          "text": "The best Pixar movie in 14 years was made by DreamWorks"
        },
        {
          "text": "how can i explain to anyone that i cried my heart out watching a baby goose learn how to fly"
        },
        {
          "text": "see dreamworks? it’s that easy, say yes yes to original projects and no no to kung fu panda 4"
        },
        {
          "text": "I recently watched THE SUBSTANCE and THE WILD ROBOT. One of them is about how women are forced to subject their bodies to unthinkable horrors in the pursuit of an impossible standard, all while an unf..."
        },
        {
          "text": "Dreamworks and their euphoric ass scores that make my soul leave my body give me a break"
        }
      ],
      "userRating": 4,
      "ratingDiff": -0.20999999999999996,
      "title": "The Wild Robot",
      "year": 2024
    },
    "The Six Triple Eight (2024)": {
      "letterboxdRating": null,
      "error": "curl failed: spawnSync /bin/sh ETIMEDOUT",
      "title": "The Six Triple Eight",
      "year": 2024,
      "userRating": 3
    },
    "Blitz (2024)": {
      "letterboxdRating": 3.03,
      "letterboxdSlug": "blitz-2024",
      "topReviews": [
        {
          "text": "can someone though genuinely please explain to me what the point of harris dickinson’s character was in this movie?? like what does he do??"
        },
        {
          "text": "to literally no one’s surprise, saoirse ronan is incredible. the day she isn’t one of the best things about a movie she’s in is the day the world ends."
        },
        {
          "text": "A conglomerate of subjects and ideas poorly written, does not decide what it wants to be; is it a drama? a war epic? Maybe it wants to be everything, but it just doesn’t work."
        },
        {
          "text": "love how harris dickinson’s character serves no purpose whatsoever he’s just there to look fine as hell"
        },
        {
          "text": "It’s strange to discover that “Blitz” is the most anonymous movie that Steve McQueen has made thus far, as this pseudo-Dickensian epic — the story of a half-Grenadian boy’s quest to reunite with his g..."
        }
      ],
      "userRating": 3,
      "ratingDiff": -0.029999999999999805,
      "title": "Blitz",
      "year": 2024
    },
    "Conclave (2024)": {
      "letterboxdRating": 3.91,
      "letterboxdSlug": "conclave",
      "topReviews": [
        {
          "text": "most diabolical vape hit of all time"
        },
        {
          "text": "your eminence, may i spill the tea"
        },
        {
          "text": "divas in long dresses gossiping with each other trying to snatch a win… this is basically rupaul’s drag race"
        },
        {
          "text": "Best third act use of a photocopier since Regina George in Mean Girls"
        },
        {
          "text": "Accidentally became important at work and it’s ruining my conclave."
        }
      ],
      "userRating": 4,
      "ratingDiff": 0.08999999999999986,
      "title": "Conclave",
      "year": 2024
    },
    "What You Wish For (2023)": {
      "letterboxdRating": 3.3,
      "letterboxdSlug": "what-you-wish-for",
      "topReviews": [
        {
          "text": "this is like The Menu’s half-sibling"
        },
        {
          "text": "An intense and unsettling psychological thriller with a neat social commentary, one that starts out slow, but intrigues you into the drama as the mysterious unpredictable plot develops with compelling..."
        },
        {
          "text": "The Menu but undercooked"
        },
        {
          "text": "What I Wished For! Go in as blind as you can! Nice little gem that slipped under the radar. This one's a slowburn thriller and let me tell you it was pretty slow at first but then it's unpredictable t..."
        },
        {
          "text": "The detective : “ Yum~ ” The guest : “ Are you enjoying, detective? ” The detective : “ Yeah, definitely. ” All the guests : 👀👀👀 This film is unintentionally hilarious and messed up, I love it. And..."
        }
      ],
      "userRating": 3,
      "ratingDiff": -0.2999999999999998,
      "title": "What You Wish For",
      "year": 2023
    },
    "Companion (2025)": {
      "letterboxdRating": 3.38,
      "letterboxdSlug": "companion-2025",
      "topReviews": [
        {
          "text": "beep boop is an absolutely diabolical pet name"
        },
        {
          "text": "I think men should be born into prison and have to earn their way out."
        },
        {
          "text": "terminator but for the girls and gays"
        },
        {
          "text": "IS IRIS A FUCKIN ANAGRAM FOR SIRI?"
        },
        {
          "text": "Insane cum-face jumpscare"
        }
      ],
      "userRating": 4,
      "ratingDiff": 0.6200000000000001,
      "title": "Companion",
      "year": 2025
    },
    "A Beautiful Mind (2001)": {
      "letterboxdRating": 3.86,
      "letterboxdSlug": "a-beautiful-mind",
      "topReviews": [
        {
          "text": "I guess you could say Paul Bettany was a vision"
        },
        {
          "text": "Here’s an equation for ya: male gaze + runtime exceeding 2 hours + slightly brown tinted colour grading = Academy Award for Best Picture, 2001"
        },
        {
          "text": "his mind wasn’t even that beautiful"
        },
        {
          "text": "jennifer connelly is beautiful alright. i'm not sure about his mind though"
        },
        {
          "text": "fight club for math geeks"
        }
      ],
      "userRating": 3,
      "ratingDiff": -0.8599999999999999,
      "title": "A Beautiful Mind",
      "year": 2001
    },
    "Little Women (2019)": {
      "letterboxdRating": 4.18,
      "letterboxdSlug": "little-women-2019",
      "topReviews": [
        {
          "text": "laurie: we look like a couple jo: a couple of besties &lt;3"
        },
        {
          "text": "Look all I know is if Timothee Chalamet asked me to marry him I would not fucking hesitate"
        },
        {
          "text": "greta gerwig: i will cast the march sisters perfectly and make them do intense research into their roles, they will embody their characters also greta gerwig: fuck it, bob odenkirk as the dad"
        },
        {
          "text": "“I want to be great, or nothing.” seen this 4 times now. great is selling it short. back to business as usual in January. sending warmth and well wishes to everyone out there in the meantime."
        },
        {
          "text": "need me a timothée chalamet to tell me im not a career failure at 20"
        }
      ],
      "userRating": 4,
      "ratingDiff": -0.17999999999999972,
      "title": "Little Women",
      "year": 2019
    },
    "Sing Sing (2023)": {
      "letterboxdRating": 4.3,
      "letterboxdSlug": "sing-sing-2023",
      "topReviews": [
        {
          "text": "every time “as himself” rolled across the screen tears also rolled down my face. what a beautiful movie"
        },
        {
          "text": "A very special movie. A reminder that in a broken system that only seeks to oppress, art serves not only as catharsis, but as liberation."
        },
        {
          "text": "nothing will radicalize you faster than knowing literally anything about the US prison system"
        },
        {
          "text": "Clarence “Divine Eye” Maclin performance of the year."
        },
        {
          "text": "Why does the caged bird sing? Because he has a voice. And the world deserves to hear it."
        }
      ],
      "userRating": 4,
      "ratingDiff": -0.2999999999999998,
      "title": "Sing Sing",
      "year": 2023
    }
  }
}